[
  {
    "title": "They Burned the Church With the Pastor Inside — and the World Moved On",
    "url": "https://pjmedia.com/chris-queen/2026/02/16/the-world-forgot-nigerias-christians-their-killers-didnt-n4949570",
    "source": "pjmedia.com",
    "date": "2026-02-16",
    "category": "conservative_us",
    "fulltext": "One of the most significant stories in recent years that doesn’t get the press it deserves is the genocide of Christians in Nigeria. Sure, Nicki Minaj has called it to international attention , and publications like PJ Media have sounded the alarm — even as recently as February 1 , when my colleague Catherine Salgado pointed out how Nigeria is a hotspot for Christian persecution. The international relief organization and watchdog Open Doors has Nigeria at #7 in its 2026 World Watch rankings for Christian persecution. This is despite the fact that 107,275,000 of Nigeria’s population is Christian — nearly half of the nation’s 220 million. “In Nigeria, Christians suffer significant and severe persecution – to such a degree that Nigeria has been the most violent place in the world for followers of Jesus for several years,” Open Doors reports. “In northern Nigeria, 12 states have implemented Islamic law, creating a system where Christians live as second-class citizens, and conversion from Islam can be severely punished.” It can be difficult to wrap our heads around what the level of persecution in Nigeria looks like. Sometimes numbers just look like statistics, so the stories behind the numbers can bring this horror to our attention more fully. The Daily Mail’s David Patrikarakos recently traveled to Nigeria to see the devastation firsthand. What he writes could break even the toughest heart: Driving through the vast, scorched landscape, I hear the words that have followed me all day. ‘They roasted the pastor and his wife alive in the church. We heard their screams.’ Plateau State stretches to the horizon. Rich black soil that once grew cassava and sugar cane is now ash. Trees are encrusted with soot. Fields of maize that shone gold in the sun are grey and lifeless, stalk after stalk standing in formation like an army frozen in defeat. Bricks lie scattered in the scrub. Concrete blocks jut from the earth like jagged teeth. Roofs have collapsed inward. And then come the churches. Burned-out shell after burned-out shell. Crosses broken. Windows blown through. One has been gutted by fire, another reduced to rubble. It’s as though someone has tried to erase every visible sign of Christianity from this land. Patrikarakos reminds us about the handful of times that Nigeria got Western attention. He writes, “It pierced Western consciousness in 2014 when Boko Haram abducted more than 270 schoolgirls, sparking the global #BringBackOurGirls campaign and drawing figures such as Michelle Obama into the outcry – and then it faded.” Remember that silly incident in which a pouty-faced first lady held up a sign that she thought would actually convince Boko Haram to do the right thing? Related: Biden Administration Revives Useless Obama-Era Tactic of 'Hashtag Diplomacy' “It flared briefly again last Christmas when Donald Trump ordered air strikes against jihadist targets in the region following renewed attacks on Christian communities, thrusting Nigeria into the centre of American political debate,” Patrikarakos continues. “Then it slipped from the headlines once more.” The Nigerian government tries to downplay the religious persecution angle of the killings, chalking the problem up to land disputes. But when villages burn, it’s the Christians who suffer. What underscores the sectarian nature of the conflict is the burning of churches. “The churches are always their main target,” a 29-year-old man called “Jonas” tells Patrikarakos. Patrikarakos also relates stories from the horrendous 2023 Christmas massacre: Reverend Silas Caleb Dang takes up the story. As Christians across the world prepared to celebrate the birth of their Saviour, gunfire ripped through the hills here. Houses were already burning when one pastor ran inside his church, locked the door and knelt at the altar. ‘He went inside the church to pray to Jesus,’ he tells me. ‘And they burned him alive.’ In nearby Muong village, the horror was repeated. At around 5pm on Christmas Eve 2023, gunshots were heard in neighbouring villages. By 6.30pm, the attackers were closing in. Sunday B. Randong, a retired civil servant now also displaced, went to the Special Task Force office in Bokkos to raise the alarm, but the officers just laughed and said they lacked personnel. Soon after, the mob arrived. ‘They torched a house with the pastor’s wife and her five children trapped inside,’ he says, sitting across from me in a mustard-coloured kaftan. ‘They were Fulani. We know this because we heard their names as they shouted to each other: “Burn this house! Burn that house!” ‘It was an anti-Christian attack, no doubt,’ he concludes. ‘They screamed, “Allahu Akbar!” as they fired, calling us all infidels.’ Of course, the Muslims blame the Christians. I’m not going to pretend that it’s as black-and-white as totally innocent Christians, but who is dying in such great numbers? One side is dying out more than the other. We need to keep shining a light on these atrocities. They’re not prett",
    "fulltext_len": 5000
  },
  {
    "title": "Trump Hits ISIS in Nigeria on Christmas, Citing Mass Christian Killings",
    "url": "https://www.breitbart.com/faith/2025/12/25/trump-hits-isis-nigeria-christmas-citing-mass-christian-killings/",
    "source": "breitbart.com",
    "date": "2025-12-25",
    "category": "conservative_us",
    "fulltext": "President Donald Trump stated that, acting as Commander in Chief, he directed the United States to carry out a “powerful and deadly strike” in northwest Nigeria against ISIS terrorists, whom he identified as responsible for targeting and killing innocent Christians at historically severe levels. On Christmas night, President Donald Trump announced : “Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” Trump wrote: I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing. Under my leadership, our Country will not allow Radical Islamic Terrorism to prosper. May God Bless our Military, and MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues. DONALD J. TRUMP PRESIDENT OF THE UNITED STATES OF AMERICA The strike follows weeks of intensifying reports of religiously targeted attacks against Christians in Nigeria, which experts and human rights advocates have consistently described as genocidal in nature. According to Breitbart News reports , Islamist groups such as Boko Haram and Fulani jihadist militias have carried out coordinated attacks across the Middle Belt and northern Nigeria for over a decade, focusing on the systematic eradication of Christian communities. These assaults have historically spiked around Christian holidays such as Christmas and Easter. During a December 16 briefing attended by Breitbart News, Nigerian officials, human rights lawyers, and religious freedom advocates described the violence as a deliberate campaign of “obliteration” against Christians. Steven Kefas, a journalist with the Observatory for Religious Freedom in Africa, reported a pattern of attacks occurring more frequently on Sundays and Christmas Eve. “If this [were] just random criminality, why not attack the Muslims in the Middle Belt on the eve of their celebration, or on Friday?” he asked rhetorically. “You never hear that.” The situation has been exacerbated by continued denials from Nigerian government officials, including President Bola Tinubu, who has dismissed the religious nature of the violence, attributing it instead to “bandits” or climate-related conflict. Tinubu, a Muslim married to a Christian, rejected President Trump’s October designation of Nigeria as a Country of Particular Concern for religious freedom, even as international concern over anti-Christian attacks grew. Despite later declaring a state of emergency and firing his defense minister, reports continue to document threats against Christian victims and those who speak out, including journalists. According to Open Doors, Nigerian Christians now endure an average of eight violent attacks per day — a crisis that critics say the government has consistently downplayed or ignored. Prime Minister Benjamin Netanyahu of Israel, in his Christmas Eve message, highlighted Israel’s protection of Christians, stating that it is “the only country in the Middle East where the Christian community is thriving.” He also briefly referenced the situation in Nigeria, declaring that “Muslim militant displacement and attacks against Christians in Nigeria — that too must end.”",
    "fulltext_len": 3575
  },
  {
    "title": "US Moves Troops Into Nigeria Amid Escalating Violence Against Christians",
    "url": "https://dailycaller.com/2026/02/04/us-moves-troops-into-nigeria-amid-escalating-violence-against-christians/",
    "source": "dailycaller.com",
    "date": "2026-02-04",
    "category": "conservative_us",
    "fulltext": "The U.S. has deployed a contingent of troops to Nigeria as violence against Christian communities by Islamist militants continues to escalate. U.S. Africa Command (AFRICOM) chief General Dagvin R.M. Anderson confirmed Tuesday that American military officers are now operating on the ground in Nigeria , according to Reuters . Nigeria has faced mounting pressure from the U.S. over its failure to protect Christian citizens from what President Donald Trump has described as an “existential threat” from Islamic militants . Anderson said the deployment followed a meeting with Nigerian President Bola Tinubu in Rome late 2025, where both sides agreed more needed to be done to confront the region’s growing terrorist threat, the outlet reported. “That has led to increased collaboration between our nations,” Anderson told reporters, explaining that the U.S. team brings “unique capabilities,” though he declined to specify when the personnel arrived or the size of the mission. (RELATED: Locked-Up Leaders: 7 Most Influential Christians Behind Bars In 2025) Catholics pray at the Saint Michael’s Cathedral during the Sunday’s service in Minna on November 30, 2025 as the congregatipon prayed for the safe return of the abducted students of Saint Mary’s Catholic School earlier this month. (Photo by Light Oriye Tamunotonye / AFP via Getty Images) “Our security cooperation efforts with Nigeria have been ongoing and we currently have a very small team there to advise and information share with our Nigerian partners,” an AFRICOM spokesperson told the Daily Caller News Foundation. “It is common for us to move people throughout the theater to support partners who share security interests. These activities are critical to enabling Nigeria’s operational independence.” The deployment marks the latest step in the Trump administration’s expanding military engagement in Nigeria. In December, Trump ordered airstrikes against Islamic State–affiliated targets in the country and warned that additional U.S. action could follow. At the time, Trump said the attack targeted “ISIS terrorist scum in northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians at levels not seen for many years, and even centuries.” Secretary of War Pete Hegseth has also stated that “either the Nigerian government protects Christians, or we will kill the Islamic terrorists who are committing these horrible atrocities.” Radical Islamist groups operating in northern Nigeria, including ISIS–West Africa, Boko Haram, and the Fulani ethnic militia, have carried out frequent murders, kidnappings and armed robberies, targeting Christians as well as nonradical Muslim communities. In late January, gunmen launched coordinated attacks on three churches in Kaduna State, abducting more than 150 worshippers, many of whom remain in captivity. Trump has recently rolled out additional measures aimed at the perpetrators, including designating Nigeria a Country of Particular Concern and restricting visas for individuals accused of aiding militant groups. The administration cited the killing of at least 3,100 Christians by these militias. Despite acknowledging the need to address rising terrorist violence, the Nigerian government has rejected claims of a Christian genocide, arguing that extremist groups target civilians regardless of religion. All content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.",
    "fulltext_len": 3775
  },
  {
    "title": "Nigerian Military, Intel Officials Meet to Plan Response to Trump",
    "url": "https://www.breitbart.com/africa/2025/11/04/nigerian-military-meets-plan-response-trump-no-plan-protect-christians/",
    "source": "breitbart.com",
    "date": "2025-11-04",
    "category": "conservative_us",
    "fulltext": "Nigerian National Security Adviser (NSA) Mallam Nuhu Ribadu met on Monday with military and intelligence officials to plan a response to President Donald Trump’s allegations that their government is not doing enough to protect Nigerian Christians. Fresh attacks on Christian villagers were perpetrated even as the meeting was underway. President Trump warned on Sunday that he is considering military intervention to “completely wipe out the Islamic terrorists who are committing these horrible atrocities.” On Monday, the State Department designated Nigeria a Country of Particular Concern (CPC) for religious persecution. NSA Ribadu met with the heads of Nigeria’s military and intelligence services on Monday at the National Counter-Terrorism Center (NCTC) in the capital of Abuja. The meeting was reportedly intended to “coordinate a unified national security response and review intelligence assessments on the potential fallout of the US president’s pronouncement.” Nigeria’s neighbor Chad evidently took Trump’s warning very seriously. Chadian President Mahamat Idriss Deby ordered a lockdown of the border with Nigeria and placed his forces on high alert, reportedly because he feared Nigerian terrorists could flee into Chad during a prospective American military operation. “No armed group or foreign force will be allowed to enter Chadian soil under any disguise,” Deby said on Sunday. Local media quoted sources in Nigeria’s Borno State, which borders on Chad, who said that despite news of the Chadian lockdown, movement across the border remained unimpeded. More terrorist violence was reported in Nigeria’s Benue State on Sunday, when community leader Atindiga Tseebee was killed in an ambush by Muslim gunmen from the Fulani tribe of herdsmen. Eyewitnesses said Tsebee was returning from a security meeting to discuss a rash of recent attacks when the assailants opened fire on his vehicle, killing him instantly. Surviving community leaders asked the central government to send more troops to secure the area. One of the recent attacks in Benue State involved Fulani herdsmen teaming up with a local militia leader known as “Heavy” Oraernyi to burn farmland in the community of Mbajir. Residents said the damage to farmland was growing so severe that they might need to abandon their homes. “We are appealing to traditional rulers, the local government chairmen of Ukum and Katsina-Ala, and the Benue State government to take urgent action before more lives are lost,” one villager told reporters. Others said they were threatened with violent reprisals if they spoke out.",
    "fulltext_len": 2589
  },
  {
    "title": "Trump's 'Save the Christians' Battle Cry: It Is Heroic, but Dodges Nigeria's Deeper Divisions",
    "url": "https://townhall.com/columnists/brad-brandon/2025/11/16/trumps-save-the-christians-battle-cry-it-is-heroic-but-dodges-nigerias-deeper-divisions-n2666477",
    "source": "townhall.com",
    "date": "2025-11-16",
    "category": "conservative_us",
    "fulltext": "In Nigeria, death and destruction show no signs of stopping. Persecution of Christians is now endemic, especially in the north, where anti-Christian violence has hit record highs . Since 2009, over 50,000 Christians have been killed by groups like Boko Haram, ISWA, and Fulani militants. In the past decade, some 18,000 churches have been destroyed. I've walked through too many charred ruins that were once places of worship. What was a peaceful region has become a landscape of death. In a recent video , a pastor stood beside a mass grave, pleading for U.S. help. God must have heard his cries. Last Friday, President Donald Trump posted on Truth Social a strongly worded call to action. He told Congressman Riley Moore and House Appropriations Committee Chairman Tom Cole to \"immediately look into the matter [of Christian persecution in Nigeria] and report back.\" \"The United States cannot stand by while such atrocities are happening. We stand ready, willing, and able to save our Great Christian Population around the world,\" he continued. As tough as Trump seems, I know he has a soft spot for oppressed people. I also know he has a history of being keenly aware of the situation in Nigeria. During his first term, Trump designated Nigeria as a Country of Particular Concern with the United States Department of State. By Saturday afternoon, he doubled down. He warned that he would stop all aid to Nigeria and go in \" guns-a-blazing \" if the Nigerian government continued to allow the murder of Christians. He said he had instructed the Department of War to prepare for possible action, urging the Nigerian government to \"move fast.\" By Sunday, when asked what he meant by \"guns-a-blazing,\" he explained U.S. troops could be deployed or even airstrikes could be utilized. As someone who has worked in this part of the world for nearly a decade, Trump's zeal to intervene is a welcome change. Both the Obama and Biden administrations did very little, standing by while thousands of Christians were massacred. In fact, not only did they stand by, but the Biden administration outright removed Nigeria's Country of Particular Concern designation, even though there were blatant human rights violations happening under the watchful eye of the Nigerian government. To see Trump taking an active role to end the attacks on Christians is a breath of fresh air, not only to me, but to many Nigerians. Every Nigerian I have spoken with said they felt the violence would continue to get worse, but Trump's words have delivered a glimmer of hope. One Nigerian said, \"The U.S. is the only country that could do something about this crisis. Because of Trump, we now have hope that things could change.\" In the case of Boko Haram and ISWA, I am completely in favor of using any means to stop their reign of terror in northern Nigeria. Military intervention seems to be the only means by which to cripple their activities because the Nigerian military is outnumbered and outgunned by radical Islamic groups. Realistically, Trump is unlikely to ever deploy U.S. military forces. His signature bombastic rhetoric is designed to provoke and dominate headlines, not to trigger actual invasions. That's why my enthusiasm for his \"guns-a-blazing\" demand to halt the slaughter of Christians in Nigeria fizzles at the slogan itself. My caution is this: The issue of the Muslim Fulani attacks on Christians is a related, but separate, crisis. Much of the violence between the Fulani herders and Christian farmers is based on socio-economic and ethnic issues and not necessarily radical Islam. Of course, there are groups of Fulani militants that are radicalized, but the majority of Fulani are peaceful people who desire harmony with their Christian neighbors. I have worked with the Fulani people for years, I speak their language, and understand their culture after embedding myself in their communities. I have met with thousands of Fulani leaders and brokered peace agreements between Fulani tribes and Christian communities that are still honored to this day. U.S. military intervention in Nigeria could likely cause the death of many innocent people, cause further instability, and draw targeted communities into radical ideology. Radical Islamic groups are masters at interlacing themselves in the communities of the innocent. This seems to be a pattern of radical Islam around the world. Many despise their presence and don't agree with them, but they are forced to join, support, and participate as a matter of survival. They simply have no other option. This is a difficult thing for Americans to understand. Even surgical airstrikes by the U.S. military would likely cause massive collateral damage. In the end, I praise Trump for his boldness and willingness to act on behalf of the millions of Christians suffering in Nigeria. As someone once said, \"The world will not be destroyed by evil, but by good people who do nothing to stop it.\" While Obama and Biden have earned their spot on that list, Trump",
    "fulltext_len": 5000
  },
  {
    "title": "Exclusive – Aid Group: Nigeria Has Ranked at Maximum Violence Against Christians for 8 Years Straight",
    "url": "https://www.breitbart.com/africa/2026/01/21/exclusive-aid-group-nigeria-has-ranked-at-maximum-violence-against-christians-for-8-years-straight/",
    "source": "breitbart.com",
    "date": "2026-01-21",
    "category": "conservative_us",
    "fulltext": "The Christians of Nigeria – nearly half of the country’s population – have shown “remarkable resilience and faith” in one of the most violent persecution climates in the world, Ryan Brown, the CEO of Open Doors, told Breitbart News this weekend. Open Doors, a humanitarian organization that specializes in offering spiritual and emergency aid to persecuted Christians around the world, publishes its annual “ World Watch List ” of the most dangerous places on the planet to practice the faith. Nigeria ranked number seven on the list this year due to targeted jihadist attacks by a variety of actors including Boko Haram, the Fulani terrorists of the Middle Belt, and organizations such as the Islamic State. “Violence continued unabated in Nigeria, which is why it continues to be ranked in the top ten of the World Watch List. In multiple instances, hundreds of Christians were killed or displaced because of attacks from Islamic militants,” Open Doors explains in its profile of the country for 2025. “Most of these attacks were carried out by militant Fulani herdsmen, who continue to target Christian communities, leading to the displacement of millions of Christians. Attacks are also carried out by Boko Haram and Islamic State West Africa Province, along with new extremist groups that are emerging.” Genocidal violence against Christians has persisted in Nigeria for over a decade, even though the country is home to over 100 million Christians. To highlight how unique that situation is in the world, the country with the second highest number of Christians on the top ten list is Pakistan, with an estimated 4.8 million Christians. Christians are believed to represent about 45 percent of the population of Nigeria, most of them in the Middle Belt and south of the country, while the plurality population of Muslims is largely concentrated in the north. Persecution has persisted despite the large number of vulnerable Christians and through multiple Nigerian presidential administrations. The current president, Bola Tinubu, has vowed to act against growing acts of violence, but for much of 2025 faced criticism that his government had done little to protect Christians. The year culminated with President Donald Trump placing Nigeria on the State Department’s list of Countries of Particular Concern (CPC) for religious persecution and cooperating with Tinubu on airstrikes against terrorists in the northwest of the country. Open Doors tracks persecution by monitoring, using its resources on the ground, how much pressure Christians face in their private lives, family, community, national life, and church life. Countries are also ranked by the violence that Christians face as a separate metric. “Nigeria has been at the maximum violence score (16.7 out of 16.7) for eight consecutive years,” Brown, the Open Doors CEO, explained to Breitbart News in response to questions this weekend. “During our most recent reporting period, 3,490 Nigerian Christians were killed because of their faith—the highest number of any country and an increase from 3,100 the previous year.” “The violence Christians face in Nigeria is driven by a complex convergence of Islamic militancy, ethnic conflict, weak governance, organized crime, and competition for resources,” Brown noted. “Groups like Boko Haram, ISWA, Fulani militants, and newer groups like Lakurawa continue to target Christian communities.” The time period covered by the annual World Watch List ends on September 30; President Trump designated Nigeria a CPC on October 31, so that action and its aftermath did not affect the scoring this year, but will in the following reporting period. “Anecdotally, we have heard from local partners that there were casualties at the US-targeted bases of these groups, but it’s difficult to speculate whether this will have significant, moderate, or no impact on the persecution in the relevant regions,” Brown told Breitbart News, assuring that Open Doors will remain active on the ground offering “trauma care, emergency relief, and persecution preparedness training regardless of what actions external governments take.” “The Nigerian church has shown remarkable resilience and faith despite years of violence,” he added. President Trump approved military action against “ISIS Terrorist Scum in Northwest Nigeria” in December, announcing the strikes on Christmas Day. “I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” Trump explained in a post on his website, Truth Social. “The Department of War executed numerous perfect strikes, as only the United States is capable of doing. Under my leadership, our Country will not allow Radical Islamic Terrorism to prosper.” Trump added, “MERRY CHRISTMAS to all, including the dead Terrorists, of which there will be many more if their slaughter of Christians continues.” The move caused some international alarm, but Tinubu’s government clarified th",
    "fulltext_len": 5000
  },
  {
    "title": "EXCLUSIVE: GOP Reps Unveil Bill To Tackle Heart Of Christian Persecution In Country",
    "url": "https://dailycaller.com/2026/02/10/gop-representatives-chris-smith-riley-moore-christian-persecution-nigeria-islam-fulani-militias/",
    "source": "dailycaller.com",
    "date": "2026-02-10",
    "category": "conservative_us",
    "fulltext": "House Republicans have introduced a bill Tuesday to prompt U.S. action to document “religious persecution and mass atrocities in Nigeria,” the Daily Caller first learned. The Nigeria Religious Freedom and Accountability Act of 2026, HR 7457, calls on the Secretary of State to give the foreign affairs committees in the House of Representatives and the Senate an annual report on U.S. efforts to address Christian persecution. It also calls on the secretary to consider whether to designate the Fulani ethnic militias a Foreign Terrorist Organization, take a look at sanctioned individuals and weigh whether U.S. assistance in Nigeria encourages Christian persecution. New Jersey Republican Rep. Chris Smith, chairman of the House Foreign Affairs Africa Subcommittee; Oklahoma Republican Rep. Tom Cole, chairman of the House Appropriations Committee; and West Virginia Republican Rep. Riley Moore co-sponsored the bill. It would continue actions already taken by the legislative and executive branches to combat Nigerian terrorism. (RELATED: Trump’s Religious Liberty Commission Sued For Being Too Christian) The bill also calls on the secretary of state to counter “the hostile foreign exploitation” of illegal Chinese mining operations in Nigeria. The bill has already garnered support from other House Republicans, including Florida Rep. and House Foreign Affairs Committee Chairman Brian Mast, Florida Rep. and Appropriations Vice Chairman Mario Diaz-Balart and Michigan Rep. and House Foreign Affairs South and East Asia Subcommittee Chairman Bill Huizenga, according to a statement sent to the Caller from Smith. The bill is expected to move through the House quickly and points to actions already taken by President Donald Trump to combat the persecution in Nigeria, according to the statement. In November 2025, Trump designated Nigeria as a Country of Particular Concern , which allows the executive to use economic and diplomatic tools against Nigeria. He also conducted coordinated strikes with the Nigerian government against the perpetrators on Christmas Day. Smith said that the U.S. has a responsibility to follow Trump’s lead by pressuring the Nigerian government to take steps to “address and punish” systemic violence against Christians and non-radical Muslims by Islamist extremists. People gather around burnt cars near St Theresa Catholic Church after a bomb blast in the Madala Zuba district of Nigeria’s capital Abuja on December 25, 2011. (Photo by SUNDAY AGHAEZE/AFP via Getty Images) “The Nigerian government’s blatant denial of the religious persecution occurring within its borders has only enabled the religious-based violence in the country to fester, with Christian deaths and church attacks reaching unprecedented numbers,” Smith said. The bill cites the destruction of churches, mass kidnappings, rape and attacks on villages and estimates that 50,000 to 125,000 Christians were martyred from 2009 to 2025. “As part of the investigation President Trump asked me to lead, I visited Nigeria and witnessed firsthand the horrors our brothers and sisters in Christ face and saw the security challenges Nigeria faces,” Moore said in the statement, adding that the bill shows that “the United States stands with our persecuted.” Cole said that defending religious liberty across the globe, including in Nigeria, is not only the U.S.’s duty, but also serves a vital American interest, according to the statement. Cole holds that the bill will add to Trump’s efforts and make it clear that “religious persecution will not be tolerated.” Judd Saul, the head of Equipping the Persecuted and Truth Nigeria, which supplies on-the-ground reporting of the atrocities, and critic of how the U.S. and Nigeria have addressed the issue, told the Caller that the bill is a “step in the right direction” and applauded the sponsors for stepping up for the cause.",
    "fulltext_len": 3873
  },
  {
    "title": "Gunmen abduct dozens of worshippers from multiple Nigerian churches using sophisticated weapons",
    "url": "https://www.foxnews.com/world/gunmen-abduct-dozens-worshippers-multiple-nigerian-churches-using-sophisticated-weapons",
    "source": "foxnews.com",
    "date": "2026-01-19",
    "category": "conservative_us",
    "fulltext": "Foundation for Defense of Democracies adjunct senior fellow Peter Doran discusses President Donald Trump’s warning that the United States could take further action if Christians continue to be targeted in Nigeria on ‘Fox Report.’ NEW You can now listen to Fox News articles! Numerous worshippers from at least two churches in Nigeria were kidnapped during Sunday services by armed gangs, Reuters reported. While Kaduna state police on Monday reportedly cited conservative figures, saying dozens were being held captive as the investigation remains in its early stages, a senior church leader noted that more than 160 worshippers were abducted by gunmen over the weekend. Sunday’s incident, which BBC said targeted both Christians and Muslims, marks the latest mass kidnapping in Nigeria’s long-running streak of religiously fueled attacks. Muslim Fulani militants frequently carry out violence in northern and central parts of Nigeria to bankrupt Christian communities while receiving ransom payments. Kaduna state police said gunmen armed with \"sophisticated weapons\" attacked two churches in the village of Kurmin Wali in Afogo ward at about 11:25 a.m. on Sunday, Reuters reported. 52 CATHOLIC SCHOOL STUDENTS IN NIGERIA KIDNAPPED BY GUNMEN IN LATEST ATTACK: REPORT People walk past a school in Nigeria on March 8, 2024, following mass kidnappings that targeted 250 students. (Haidar Umar/AFP via Getty Images) Reverend John Hayab, the chairman of the Christian Association of Nigeria located in the northern part of the country, told Reuters: \"Information came to me from the elders of the churches that 172 worshipers were abducted while nine escaped,\" Hayab said. Early estimates from security agencies tend to be conservative, while community and religious leaders often report higher numbers. In Nigeria, casualty and abduction figures often vary widely in the days following mass kidnappings. NIGERIA NAMED EPICENTER OF GLOBAL KILLINGS OF CHRISTIANS OVER FAITH IN 2025, REPORT SAYS Security officers patrol an area in Janjala Village, Nigeria, on Friday, Feb. 24, 2017, following the abduction and killings of multiple people. (Lekan Oyekanmi/AP Photo) Police said troops and other security agencies had been deployed to the area, with efforts underway to track the abductors and secure the release of the captives, Reuters reported. Nigeria has experienced a dramatic surge in mass attacks by armed gangs, particularly Islamist militants, who often operate from forest enclaves and target villages, schools and places of worship. GUNMEN ATTACK CHURCH IN NIGERIA, KILLING TWO AND KIDNAPPING OTHERS In 2025, Nigeria was named the epicenter of global killings of Christians, according to the Open Doors World Watch List. The report noted that while Muslims are also frequently attacked, Christians have been \"disproportionately targeted,\" with one in five African Christians facing high levels of persecution. Woman in Benue State Christian refugee camp. The camp is inhabited by Christians who fled anti-Christian violence. (Open Doors) CLICK HERE TO DOWNLOAD THE FOX NEWS APP In November, 52 Catholic students, along with several staff members, were kidnapped by gunmen at St. Mary’s School in Nigeria, The Associated Press reported. In April, the Evangelical Church Winning All, a major church based in West Africa, said it paid the equivalent of $205,000 in ransom to secure the release of roughly 50 members kidnapped in Kaduna, Nigerian lawyer Jabez Musa told Fox News Digital. Fox News Digital's Paul Tilsley, Rachel Wolf, Reuters and The Associated Press contributed to this report. Bonny Chu is a Digital Production Assistant at Fox News Digital.",
    "fulltext_len": 3661
  },
  {
    "title": "Nigeria's Christian persecution score rises",
    "url": "https://www.newsweek.com/nigerias-christian-persecution-score-rises-11366383",
    "source": "newsweek.com",
    "date": "2026-01-15",
    "category": "mainstream_us",
    "fulltext": "Nigeria is one of the most dangerous countries in the world to be a Christian, according to a new report from the nonpartisan Christian advocacy organization Open Doors. The country is number seven on the Open Doors World Watch List 2026 , an annual ranking of the 50 countries where Christians face the most persecution. The organization gives each country an overall score based on how much persecution and violence Christians face. Nigeria’s score was 89 out of a possible 100 this year, up from 88 in 2025. The country ranked 12th on the 2020 list, with a score of 80, but has since climbed higher. It also ranked in seventh place in 2024 and 2025. North Korea topped the list, followed by Somalia, Yemen, Sudan and Eritrea. Newsweek reached out to the U.S. State Department and the Nigerian government via email for comment. Why It Matters The report’s findings come after the United States launched strikes against Islamic State militants in the northwestern state of Sokoto in Nigeria on Christmas Day, after weeks of President Donald Trump and others criticizing the country’s government for failing to rein in the targeting of Christians. The region has seen growing violence in recent months, with analysts saying it affects both Christians, who are predominant in the south, and Muslims, who are the majority in the north. Nigeria’s government has previously said that people of many faiths, not just Christians, have suffered attacks at the hands of extremist groups in the country. What To Know According to the report, Nigeria is “beset by a severe combination of ethno-religious hostility, Islamist militancy, weak governance and organised crime.” It said that of the 4,849 Christians killed for faith-related reasons between October 1, 2024, and September 20, 2025, the period Open Doors analyzed, 3,490 of them were in Nigeria—an increase from 3,100 in the previous year. The report cited the June massacre of more than 200 people by militants in a Christian farming community. “In a single incident in June 2025, the Christian farming community of Yelwata in Benue State came under a four-hour attack by ethnic Fulani militants,” the report said. “They shot or burned to death more than 200 people, mostly women and children. There was little military response.” According to Open Doors, persecution of Christians is most severe in the northern part of Nigeria, where it says “Islamic militants operate with impunity.” Christians, particularly converts from Islam, who live in states governed by Islamic law, are at great risk, it said. However, experts and residents have told the Associated Press that while some attacks in that part of the country have targeted Christians, everyone is a potential victim regardless of their beliefs or background. Meanwhile, data from two nonpartisan sources, the U.S.-based Armed Conflict Location & Event Data Project and Council on Foreign Relations, show that Christians are often targets in a small percentage of overall attacks that appear to be motivated by religion, in some northern states, the AP reported. But the numbers and analysts also indicate that most victims of overall violence are Muslims across the north. While the Nigerian government has not denied that Christians have been killed, it has pushed back on allegations that extremists are systemically targeting Christians, calling it a “gross misrepresentation of reality.” The government said that \"terrorists attack all who reject their murderous ideology.” What People Are Saying Henrietta Blyth, CEO of Open Doors UK and Ireland , told Newsweek that the latest scores cover the 12 months ending on September 30, 2025, so \"the most recent developments in Nigeria aren’t recorded.\" Blyth said: \"Nigeria’s score for violence was already as high as it could be, with 3,490 Christians killed for reasons connected to their faith, with 390 more than last year, and 72 percent of the total number recorded worldwide. \"The nature of the persecution varies from region to region, with the north-west rife with what is referred to as 'banditry.' There is a whole abduction industry in the region. The concern now is that these groups have been influenced by radical jihadist ideologies, giving the violence a religious justification. In some north-eastern states it is militant Islamist groups such as Boko Haram and others, actively attacking Christians and many Muslims too. And then in the North Central Belt, which includes states like Benue and Plateau state you find radicalized militant herdsman from the Fulani attacking largely Christian farmers in order to destroy churches and villages.\" President Donald Trump said in an interview with The New York Times about the possibility of further strikes on Nigeria: \"I'd love to make it a one-time strike. But if they continue to kill Christians it will be a many-times strike.” He added, “I think that Muslims are being killed also in Nigeria, but it’s mostly Christians. But there are others being killed, which I’m very u",
    "fulltext_len": 5000
  },
  {
    "title": "Nigeria's bonds slip after Trump threat of military action",
    "url": "https://www.reuters.com/world/africa/nigerias-bonds-slip-after-trump-threat-military-action-2025-11-03/",
    "source": "reuters.com",
    "date": "2025-11-03",
    "category": "mainstream_us",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "Nigeria says it 'will welcome American support,' denies Christian genocide",
    "url": "https://www.newsweek.com/nigeria-says-it-will-welcome-american-support-denies-christian-genocide-10989605",
    "source": "newsweek.com",
    "date": "2025-11-04",
    "category": "mainstream_us",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "Nigeria reacts to US ISIS attack as new video shows airstrike",
    "url": "https://www.newsweek.com/nigeria-reacts-to-us-isis-attack-as-new-video-shows-airstrike-11271127",
    "source": "newsweek.com",
    "date": "2025-12-26",
    "category": "mainstream_us",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "The Screwdriver Salesperson Behind Trump’s Airstrikes in Nigeria",
    "url": "https://www.seattletimes.com/nation-world/the-screwdriver-salesperson-behind-trumps-airstrikes-in-nigeria/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
    "source": "seattletimes.com",
    "date": "2026-01-18",
    "category": "mainstream_us",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "Nicki Minaj working with Trump admin on plight of Christians in Nigeria",
    "url": "https://www.newsweek.com/nicki-minaj-christian-persecution-nigeria-trump-administration-11058140",
    "source": "newsweek.com",
    "date": "2025-11-17",
    "category": "mainstream_us",
    "fulltext": "Nicki Minaj is set to work with the Trump administration on the plight of Christians in Nigeria. Mike Waltz, the U.S. envoy to the United Nations, announced a meeting with the rapper on X, writing: “I look forward to standing with her as we discuss the steps the President and his administration are taking to end the persecution of our Christian brothers and sisters.” Anna Kelly, a spokesperson for the White House, said in a statement to Newsweek that \"we are grateful that Nicki Minaj is using her platform to speak out on these atrocities, only proving what Barbz have known all along: she is Super-Based.” Newsweek has contacted a representative for Minaj and the office for the U.S. mission to the United Nations, outside of regular working hours via email, for comment. Why It Matters Nigeria is the most populous nation in Africa, with a population of close to 240 million, and is a major power with the fourth-highest gross domestic product (GDP) on the continent. The county is evenly split between Christians and Muslims. However, the nation has long had to deal with suggestions by some evangelical Christians in the U.S. and politicians that there is a deliberate campaign of extermination being undertaken against Nigeria’s Christian population. There are conflicting statistics about how many Christians have died in Nigeria , and how many have died as a result of their faith. International Christian advocacy group Open Doors lists Nigeria as the seventh-most dangerous place for Christians on its World Watch list and says “more Christians are killed for their faith in Nigeria than in the rest of the world combined.” Nigeria has said it is committed to tackling violent extremism but has rejected any suggestion that a genocide against Christians is taking place in the West African nation. In his first administration, Trump placed Nigeria on the U.S. religious freedom watchlist, but former President Joe Biden lifted that designation during his administration. Trump has now announced his intent to designate Nigeria as a “country of particular concern” for religious freedom violations. What To Know Journalist Eric Cortellessa of TIME posted on X that Waltz and Minaj are set to deliver remarks this week on “the persecution of Christians in Nigeria,” in a post viewed 1.3 million times. Responding to this on X, Waltz confirmed the meeting, saying that he was looking forward to meeting with Minaj and praised her for being “a principled individual who refuses to remain silent in the face of injustice.” Minaj, in turn, replied to this and said that she is “so grateful to be entrusted with an opportunity of this magnitude.” She added that she and the “Barbz,” a name for her fans, will “never stand down in the face of injustice.” Minaj has previously spoken about the persecution of Christians in Nigeria and praised Trump for his remarks on the matter. She wrote in a post on X in early November: “No group should ever be persecuted for practicing their religion. We don’t have to share the same beliefs in order for us to respect each other. Numerous countries all around the world are being affected by this horror & it’s dangerous to pretend we don’t notice.” The violence in Nigeria is being carried out by Islamic jihadist groups, including Fulani militants, Boko Haram and ISWAP (Islamic State West Africa Province), according to Open Doors. In 2009, Boko Haram launched an insurgency to establish a caliphate in Nigeria and the broader Sahel (the semi-arid transitional zone between the Sahara and savannas). Kimiebi Imomotimi Ebienfa, a spokesperson for Nigeria’s foreign ministry, has said that his country has “noted” the U.S. statement on religious freedom, saying: “We remain committed in our resolve to tackle the violent extremism that is fueled by special interests who have helped drive such decay and division in countries across the intersecting West African and Sahel regions.” This designation from the U.S. would enable the institution of punitive measures and sanctions on the country, such as restricting non-humanitarian aid. What People Are Saying Nicki Minaj wrote in a post on X: “Ambassador, I am so grateful to be entrusted with an opportunity of this magnitude. I do not take it for granted. It means more than you know. The Barbz & I will never stand down in the face of injustice. We’ve been given our influence by God. There must be a bigger purpose.” Anna Kelly, a spokesperson for the White House, in a statement to Newsweek over email : \"President Trump has been clear that Christianity is facing an existential threat in Nigeria, and the United States is prepared to stop all aid and assistance, and wipe out the Islamic terrorists responsible, if the government allows this to continue.\" Daniel Bwala, an adviser to Nigerian President Bola Tinubu, said previously : “Nigeria is a partner nation to the U.S., not a hostile one. The 'Christian genocide' narrative is a misrepresentation of our complex security reality, which affect",
    "fulltext_len": 5000
  },
  {
    "title": "Map shows countries where Christian persecution growing",
    "url": "https://www.newsweek.com/map-shows-countries-where-christian-persecution-growing-11364931",
    "source": "newsweek.com",
    "date": "2026-01-15",
    "category": "mainstream_us",
    "fulltext": "A new report by the Christian charity Open Doors has highlighted which countries have the most extreme levels of Christian persecution worldwide. The advocacy group said that Christian persecution was at an \"all-time high,\" and that \"Nigeria remains the global epicenter of deadly violence against Christians.\" In 2026, more than 388 million Christians worldwide, or one in seven, faced high levels of persecution and discrimination for their faith, which the charity said was 8 million more people than last year. Commenting on the report, Nina Shea, senior fellow of the Hudson Institute and director of its Center for Religious Freedom, who is not part of the charity, told Newsweek : \"The level of persecution against Christians is the highest it’s been since the Iron Curtain existed under Soviet Communism. The bloodiest persecution occurs now in Asia and Africa, instead of in Eastern Europe.\" A U.S. Department of State spokesperson told Newsweek that \"President Trump has said that 'the killing of innocent Christians must end.' The United States stands ready, willing, and able to act.\" \"As Secretary Rubio said, 'The ongoing slaughter of thousands of Christians in Nigeria by radical Islamists and Fulani ethnic militias is both tragic and unacceptable,'\" the spokesperson added. Newsweek has contacted the Nigerian government via email for comment. Why It Matters Open Doors’ report lands amid heightened U.S.-Nigeria tensions after U.S. strikes on militant targets in late December. Trump has tied the action to concern over attacks on Christians, while Nigerian officials say the violence affects multiple faith communities. The Nigerian government has not denied that Christians have been killed , but has said allegations that extremists are targeting Christians are a “gross misrepresentation of reality.” It said that \"terrorists attack all who reject their murderous ideology.” In its report , Open Doors noted that \"of the 4,849 Christians killed worldwide during the World Watch List 2026 reporting period because of their Christian identity, 3,490 of them were in Nigeria, an increase from 3,100 in the previous year.\" The World Watch List 2026 does not include data from October to December 2025, as the scores cover the 12 months ending on September 30, 2025, meaning that the most recent escalations in Nigeria are not reflected in the data, the charity told Newsweek . For its sources, Open Doors relies on traditional media, social media, where the reports can be verified, rights groups, as well as local partners, but Newsweek has not been able to independently verify its numbers. Similar reports have also pointed to Nigeria as one of the main countries where Christians are being persecuted. A Global Christian Relief 2026 report , based on data from November 1, 2023, to October 31, 2025, had Nigeria ranked as the highest for Christian killings, followed by the Democratic Republic of the Congo, Ethiopia, Russia and Mozambique. When asked about the current situation in Nigeria, Henrietta Blyth, CEO of Open Doors UK and Ireland, told Newsweek : \"I am heartbroken. I'm heartbroken at the gender-based violence and the way it affects women and girls and destroys families. I'm heartbroken at the kidnapping and execution of pastors and the burning of church buildings.\" What To Know The report, the 2026 edition of the World Watch List, came out on Wednesday , and allocates countries' scores based on the pressure and violence against Christians. This includes pressure felt in regard to private life, family life, community life, national life and church life, while violence refers to the number and severity of violent incidents against Christians and the church. Countries with scores of 81 or above are recognized by the charity as having \"extreme\" levels of persecution, while those with scores of between 61 and 80 are considered to have \"very high\" levels of persecution, and those with scores between 41 and 60 are thought to have \"high\" levels of persecution. The countries with \"extreme\" levels of persecution included (in order of ranking): North Korea, Somalia, Yemen, Sudan, Eritrea, Syria, Nigeria, Pakistan, Libya, Iran, Afghanistan, India, Saudi Arabia, Myanmar and Mali. Compared with the charity's 2025 map, these rankings have changed in 2026: Libya moved down the rankings, from fourth in 2025 to ninth in 2026; Sudan and Eritrea both moved up a spot in the rankings in 2026; Mali kept the same ranking but went from having a \"very high\" persecution level to \"extreme\" in 2026. Nigeria also maintained the same ranking (seventh), but its total score increased by one. There was also a notable increase in total persecution scores in many countries. In total, 15 countries hit record-high violence against Christians in the past year, so around a third of the list of 50 nations, according to Open Doors. The reason why Christian persecution is increasing is due to two major developments, Shea told Newsweek . These include \"the crackdown on re",
    "fulltext_len": 5000
  },
  {
    "title": "Trump warns USA could do things ‘Nigeria is not going to be happy about’",
    "url": "https://www.newsweek.com/trump-warns-usa-could-do-things-nigeria-is-not-going-to-be-happy-about-11001063",
    "source": "newsweek.com",
    "date": "2025-11-06",
    "category": "mainstream_us",
    "fulltext": "Donald Trump has repeated a threat of military action in Nigeria by sharing a video saying that America will “do things to Nigeria that Nigeria’s not going to be happy about” if the killings of Christians continue. The U.S. president shared videos on Wednesday repeating messages he has previously posted on Truth Social. When Newsweek contacted the White House for comment, a spokesperson said the clips are not AI, \"he just looks that good.\" Nigeria has vehemently denied that Christians in the country are being targeted for their religion, arguing that they are part of the many people falling victim to terrorists plaguing parts of the country. But the Trump administration has not accepted this, and last week announced plans to designate Nigeria a “country of particular concern.” Why It Matters Trump’s repeated remarks have sparked both alarm and hope among various stakeholders in Nigeria and the U.S., raising questions about religious freedom, U.S. foreign policy and regional stability in West Africa. With Nigeria being Africa’s most populous country and a strategic U.S. partner, any escalation in rhetoric or action carries significant humanitarian and geopolitical implications. The U.S. listing of Nigeria as a \"country of particular concern\" for religious freedom also sets the legal and diplomatic framework for further measures, including aid restrictions and possible military intervention. What To Know The President on Wednesday posted a video, largely repeating a Truth Social post he made on November 1 , saying: “If the Nigerian government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid an assistance to Nigeria – we’re going to do things to Nigeria that Nigeria’s not going to be happy about - and may very well go into that now-disgraced country guns a blazing to completely wipe out the Islamic terrorists who are committing these horrible, horrible atrocities. “I’m hereby instructing our Department of War to prepare for possible action. If we attack, it will be fast, vicious and sweet, just like the terrorist thugs attack our cherished Christians. These are cherished people, these are great people – leave them alone. Warning: The Nigerian government better move fast before it’s too late. If they don’t there’s going to be hell to pay. “ It comes Daniel Bwala, an adviser to Nigerian President Bola Tinubu, said it would “welcome American support” fighting terrorism as long as it respected its national sovereignty. Bwala said Nigeria “recognizes the passion and the zeal that President Donald Trump has demonstrated wanting to help Nigeria.” “And we welcome that, as long as that respects our territorial integrity,” he told South Africa’s SABC News . “And what we welcome, in this collaboration is, we know the Americans know that we need high-tech fighter jets, we need high-tech equipment, we need high-tech machinery for the purposes of curtailing and destroying this Boko Haram.” “But the idea of coming militarily into our soil would violate international order, would violate international convention,” he added. “It would not be good because Nigeria is not a hostile country, Nigeria is a partner with the American government in many respects.” Newsweek spoke to Benjamin Augé, a research fellow at the French Institute of International Relations (IFRI) to look at what military action in Nigeria might look like. \"I am very skeptical about any concrete involvement of U.S. troops, whether it's on the ground or via airstrike,\" Augé previously told Newsweek . \"As the majority of people killed due to terrorist groups in Nigeria are Muslims, it's a bit delicate to have any involvement based on a vision of Christians killed by Muslims,\" Augé said. \"Both communities are targeted regardless of their religion.\" What People Are Saying Bishop Matthew Hassan Kukah of the Roman Catholic Diocese of Nigeria's northwestern Sokoto province previously told Newsweek : \"President Trump’s threats should be seen as a step meant to create both fear and hope. Fear for the government and hope for the Christians. However, we know that the issues are not simply black and white.\" \"However, coming from someone of the status of President Trump, the Christians in Nigeria appreciate the concerns,\" Kukah said. \"It is important for the Nigerian government to respond by placing short-, medium- and long-term plans towards restoring peace and ensuring that any form of discrimination against Christians is reverse immediately.\" A U.S. State Department spokesperson previously told Newsweek that \"President Trump has underscored that the United States stands ready, willing, and able to act,\" and cited Secretary of State Marco Rubio in saying that \"the ongoing slaughter of thousands of Christians in Nigeria by radical Islamists and Fulani ethnic militias is both tragic and unacceptable.” What Happens Next It is currently unclear whether the Trump administration will pursue military action or rely on diplomatic and economic ",
    "fulltext_len": 5000
  },
  {
    "title": "Attacks leave 30 dead in Nigeria Benue state – The Frontier Post",
    "url": "https://thefrontierpost.com/attacks-leave-30-dead-in-nigerias-benue-state/",
    "source": "thefrontierpost.com",
    "date": "20260207T114500Z",
    "category": "other",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "The US will restrict visas for Nigerians and their families involved in violence against Christians",
    "url": "https://www.newsday.com/news/nation/nigeria-trump-visa-christian-u02677",
    "source": "newsday.com",
    "date": "2025-12-03",
    "category": "other",
    "fulltext": "ABUJA, Nigeria — The United States will restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country, the U.S. State Department said Wednesday. The attacks on the community are part of a longstanding and extremely complex security crisis in Nigeria — a nation recently singled out by U.S. President Donald Trump for “the killing of Christians” by “radical Islamists.” Last month, Trump also said he has ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. “The United States is taking decisive action in response to the mass killings and violence against Christians by radical Islamic terrorists, Fulani ethnic militias, and other violent actors in Nigeria and beyond,” U.S. Secretary of State Marco Rubio said in a statement posted on X. He added that the policy would apply to other governments or individuals engaged in violations of religious freedom, and that the restrictions are in line with a new policy under the Immigration and Nationality Act. The move follows the designation of Nigeria by the U.S. as a “country of particular concern” under the International Religious Freedom Act last month. It wasn’t immediately clear how Wednesday’s policy would be implemented, as the State Department already has the ability to restrict travel to the U.S. by those involved in human rights abuses. U.S. Secretary of State Marco Rubio speaks to traveling journalists at the John C. Munro Hamilton International Airport in Hamilton, Ontario, Canada, on Nov. 12, 2025 after the G7 foreign ministers meeting. Credit: AP/Mandel Ngan In addition to Nigeria, the list of nations designated as “countries of particular concern” includes China, Cuba, Eritrea, Iran, Myanmar, North Korea, Nicaragua, Pakistan, Russia, Saudi Arabia, Tajikistan and Turkmenistan. Attacks in Nigeria have varying motives. There are religiously motivated ones targeting both Christians and Muslims, as well as clashes between farmers and herders over dwindling resources, communal rivalries, secessionist groups, and ethnic clashes. Nigeria’s population of about 220 million people is split almost equally between Christians and Muslims. The West African country has long faced insecurity from various fronts including the Boko Haram extremist group, which seeks to establish its radical interpretation of Islamic law and has also targeted Muslims it deems are not Muslim enough. U.S. Secretary of State Marco Rubio speaks to traveling journalists at the John C. Munro Hamilton International Airport in Hamilton, Ontario, Canada, on Nov. 12, 2025 after the G7 foreign ministers meeting. Credit: AP/Mandel Ngan Also, there has been an uptick in the activities of armed gangs in the central part of the country who kidnap locals for ransom.",
    "fulltext_len": 2862
  },
  {
    "title": "US to restrict visas of Nigerians responsible for violence against Christians",
    "url": "https://www.ocregister.com/2025/12/03/us-nigeria-visas/",
    "source": "ocregister.com",
    "date": "2025-12-03",
    "category": "other",
    "fulltext": "By DYEPKAZAH SHIBAYAN, Associated Press ABUJA, Nigeria (AP) — The United States will restrict visas for Nigerians and their family members involved in mass killings and violence against Christians in the West African country, the U.S. State Department said Wednesday. The attacks on the community are part of a longstanding and extremely complex security crisis in Nigeria — a nation recently singled out by U.S. President Donald Trump for “the killing of Christians” by “radical Islamists.” Last month, Trump also said he has ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution. “The United States is taking decisive action in response to the mass killings and violence against Christians by radical Islamic terrorists, Fulani ethnic militias, and other violent actors in Nigeria and beyond,” U.S. Secretary of State Marco Rubio said in a statement posted on X. He added that the policy would apply to other governments or individuals engaged in violations of religious freedom, and that the restrictions are in line with a new policy under the Immigration and Nationality Act. The move follows the designation of Nigeria by the U.S. as a “country of particular concern” under the International Religious Freedom Act last month. It wasn’t immediately clear how Wednesday’s policy would be implemented, as the State Department already has the ability to restrict travel to the U.S. by those involved in human rights abuses. In addition to Nigeria, the list of nations designated as “countries of particular concern” includes China, Cuba, Eritrea, Iran, Myanmar, North Korea, Nicaragua, Pakistan, Russia, Saudi Arabia, Tajikistan and Turkmenistan. Attacks in Nigeria have varying motives. There are religiously motivated ones targeting both Christians and Muslims, as well as clashes between farmers and herders over dwindling resources, communal rivalries, secessionist groups, and ethnic clashes. Nigeria’s population of about 220 million people is split almost equally between Christians and Muslims. The West African country has long faced insecurity from various fronts including the Boko Haram extremist group, which seeks to establish its radical interpretation of Islamic law and has also targeted Muslims it deems are not Muslim enough. Also, there has been an uptick in the activities of armed gangs in the central part of the country who kidnap locals for ransom. AP Diplomatic Writer Matthew Lee contributed to this report.",
    "fulltext_len": 2508
  },
  {
    "title": "In memory of Imam Abdullahi Abubakar",
    "url": "https://www.thecable.ng/in-memory-of-imam-abdullahi-abubakar/",
    "source": "thecable.ng",
    "date": "20260118T013000Z",
    "category": "other",
    "fulltext": "error: Content is protected from copying.",
    "fulltext_len": 41
  },
  {
    "title": "US lawmakers return from Nigeria , to brief Trump on  shocking , harrowing  accounts of killings – Business Hallmark",
    "url": "https://hallmarknews.com/us-lawmakers-return-from-nigeria-to-brief-trump-on-shocking-harrowing-accounts-of-killings/",
    "source": "hallmarknews.com",
    "date": "20251212T121500Z",
    "category": "other",
    "fulltext": "A United States congressional delegation led by Congressman Riley Moore has wrapped up a fact-finding mission to Nigeria amid reports of widespread killings, particularly targeting Christian communities, and is expected to brief President Donald Trump before the end of the month. The five-member team arrived in Nigeria on Sunday, visiting Internally Displaced Persons (IDP) camps, survivors of terrorist attacks, Christian leaders, and traditional rulers—especially in Benue State, an area described by the delegation as one of the most affected by the violence. They also met with National Security Adviser Nuhu Ribadu and Attorney-General of the Federation, Lateef Fagbemi (SAN). ‘Shocking and harrowing’ accounts Speaking on Fox News on Thursday, Moore described the mission as “the most disturbing experience of my career,” citing accounts of brutal attacks allegedly carried out by Fulani and Islamic extremists. He recounted meeting a woman who witnessed five of her children killed while she was pregnant and later delivered her baby in an IDP camp. “You can see that her soul has literally left her body,” Moore said. “There are countless stories like these.” Another woman, he said, lost her husband, two daughters, and unborn child during a single attack. Moore said such cases suggest that Christian communities are being deliberately targeted. High-risk mission Due to security concerns, the delegation moved across Benue State in armoured vehicles, meeting Catholic and Protestant leaders, bishops, and community heads to gather what Moore called “ground truth.” “Benue is one of the most dangerous states in Nigeria. This is where the majority of Christians are being murdered for their faith,” he said. Moore also dismissed claims that the violence is driven by land disputes or climate change. “For those who say this is about climate change or economics – why would you burn down a church or attack an IDP camp shouting ‘Allahu Akbar’? The answer is clear – they are trying to erase Christians from their ancestral homeland.” Report to Trump Moore confirmed that President Trump tasked him and House Appropriations Chairman Tom Cole with compiling a comprehensive report and making recommendations. “We will report back to the President by the end of this month,” he said. In late October, Trump designated Nigeria a “Country of Particular Concern” over alleged Christian genocide, a classification rejected by the Nigerian government, which insists the security crisis is rooted in criminality rather than religion.",
    "fulltext_len": 2535
  },
  {
    "title": "Στοχοποιούνται οι χριστιανοί στη Νιγηρία , όπως υποστηρίζει ο Τραμπ ; ",
    "url": "https://www.lifo.gr/now/world/stohopoioyntai-oi-hristianoi-sti-nigiria-opos-ypostirizei-o-tramp",
    "source": "lifo.gr",
    "date": "20251226T151500Z",
    "category": "other",
    "fulltext": "Οι αμερικανικές επιδρομές κατά στόχων του Ισλαμικού Κράτους στη Νιγηρία , που ανακοίνωσε ο Ντόναλντ Τραμπ επικαλούμενος επιθέσεις εναντίον «κυρίως αθώων χριστιανών», έφεραν στο προσκήνιο στην Ουάσινγκτον ένα αφήγημα περί συστηματικής στοχοποίησης χριστιανικών κοινοτήτων. Ρεπορτάζ του BBC, ωστόσο, σημειώνει ότι τα δεδομένα που χρησιμοποιούνται για να στηριχθούν οι πιο βαρύγδουπες καταγγελίες είναι δύσκολο να επαληθευτούν . Στην Ουάσινγκτον και στα κοινωνικά δίκτυα κυκλοφορούν εδώ και μήνες αριθμοί για δεκάδες χιλιάδες χριστιανούς νεκρούς και για χιλιάδες κατεστραμμένες εκκλησίες από το 2009, ενώ τον Σεπτέμβριο ο τηλεπαρουσιαστής Μπιλ Μάχερ έκανε λόγο ακόμη και για «γενοκτονία», παραπέμποντας στη δράση της Μπόκο Χαράμ. Η κυβέρνηση της Νιγηρίας απορρίπτει τους ισχυρισμούς περί στοχευμένης εκστρατείας κατά χριστιανών ως «χονδροειδή διαστρέβλωση» , χωρίς να αρνείται ότι η χώρα βιώνει θανατηφόρα βία. Επισημαίνει, όμως, ότι οι ένοπλες οργανώσεις επιτίθενται σε όσους δεν αποδέχονται την ιδεολογία τους, είτε είναι μουσουλμάνοι είτε χριστιανοί είτε δεν έχουν θρησκεία. Παράλληλα, οργανισμοί που παρακολουθούν την πολιτική βία στη Νιγηρία εκτιμούν ότι οι αριθμοί που αναπαράγονται στις ΗΠΑ είναι υπερβολικοί και ότι, συνολικά, οι μεγαλύτερες απώλειες από τη δράση τζιχαντιστικών ομάδων αφορούν μουσουλμανικούς πληθυσμούς . Αναλυτές ασφαλείας που μίλησαν στο BBC σημειώνουν ότι χριστιανικές κοινότητες έχουν δεχθεί επιθέσεις στο πλαίσιο μιας ευρύτερης στρατηγικής εκφοβισμού, ωστόσο δεν θεωρούν τεκμηριωμένο τον ισχυρισμό ότι υπάρχει συστηματική, αποκλειστική στοχοποίηση λόγω θρησκείας. Επιπλέον, το BBC υπογραμμίζει ότι η Νιγηρία αντιμετωπίζει πολλαπλές κρίσεις ασφάλειας, με διαφορετικές αιτίες ανά περιοχή, και ότι η σύγχυση μεταξύ τζιχαντιστικής βίας, εγκληματικών δικτύων και τοπικών συγκρούσεων οδηγεί συχνά σε απλουστευτικά συμπεράσματα. Τι υποστηρίζουν οι Αμερικανοί πολιτικοί για την κατάσταση στη Νιγηρία Στην Ουάσινγκτον, το θέμα έχει σηκώσει πολιτικό βάρος. Ο Ρεπουμπλικανός γερουσιαστής Τεντ Κρουζ, από το Τέξας, είναι από όσους πιέζουν συστηματικά, υιοθετώντας αριθμούς που παραπέμπουν στις πιο δραματικές εκδοχές της υπόθεσης. Σε ανάρτησή του στις 7 Οκτωβρίου υποστήριξε ότι από το 2009 «έχουν σφαγιαστεί πάνω από 50.000 χριστιανοί» και ότι έχουν καταστραφεί «πάνω από 18.000 εκκλησίες και 2.000 χριστιανικά σχολεία» . Σε επικοινωνία με το BBC, το γραφείο του διευκρίνισε ότι ο ίδιος δεν μιλά για «γενοκτονία», αλλά για «διωγμό». Παράλληλα, ο Κρουζ κατηγόρησε τις αρχές της Νιγηρίας ότι «αγνοούν ή ακόμη και διευκολύνουν» τη μαζική δολοφονία χριστιανών από ισλαμιστές ενόπλους. Αντίστοιχες διατυπώσεις υιοθέτησε και ο Τραμπ, ο οποίος έχει χαρακτηρίσει τη Νιγηρία «ντροπιασμένη χώρα» και έχει ισχυριστεί ότι η κυβέρνηση «επιτρέπει» να σκοτώνονται χριστιανοί. Η Αμπούτζα απορρίπτει τους ισχυρισμούς, επιμένοντας ότι επιχειρεί να αντιμετωπίσει τις ένοπλες οργανώσεις, ενώ ορισμένοι αξιωματούχοι έχουν αφήσει να εννοηθεί ότι θα έβλεπαν θετικά αμερικανική συνδρομή, υπό την προϋπόθεση ότι δεν θα γίνει μονομερώς. Το BBC σημειώνει ότι οι νιγηριακές αρχές δυσκολεύονται εδώ και χρόνια να περιορίσουν τόσο τις τζιχαντιστικές οργανώσεις όσο και τα εγκληματικά δίκτυα . Η Μπόκο Χαράμ, γνωστή διεθνώς από την απαγωγή των κοριτσιών στο Τσιμπόκ, δρα από το 2009, με επίκεντρο κυρίως τη βορειοανατολική χώρα. Στην ίδια περιοχή έχουν εμφανιστεί και άλλες οργανώσεις, όπως το Ισλαμικό Κράτος στη Δυτική Αφρική (ISWAP). Από που προέρχονται οι αριθμοί που επικαλείται ο Τραμπ; Το κρίσιμο ερώτημα, όμως, είναι από πού προέρχονται οι αριθμοί που αναπαράγονται στις ΗΠΑ. Το BBC αναφέρει ότι ο Κρουζ παρέπεμψε ευθέως σε έκθεση του 2023 της οργάνωσης International Society for Civil Liberties and Rule of Law (InterSociety), ενώ σύνδεσμοι που απέστειλε το γραφείο του οδηγούσαν, κατά βάση, σε δημοσιεύματα που ξαναγυρίζουν στην ίδια πηγή. Για τον Μάχερ δεν υπήρξε απάντηση ως προς την προέλευση των αριθμών, ωστόσο οι ομοιότητες κάνουν πιθανό ότι στηρίχθηκε σε αντίστοιχο υλικό. VIDEO Κατά το BBC, το πρόβλημα είναι ότι η μεθοδολογία της InterSociety δεν είναι διαφανής. Σε νεότερη έκθεση που δημοσιεύτηκε τον Αύγουστο, η οργάνωση υποστηρίζει ότι τζιχαντιστικές ομάδες έχουν σκοτώσει πάνω από 100.000 χριστιανούς από το 2009 και ότι την ίδια περίοδο έχασαν τη ζωή τους και περίπου 60.000 «μετριοπαθείς μουσουλμάνοι». Ωστόσο, δεν παραθέτει αναλυτικό κατάλογο πηγών που να επιτρέπει την επαλήθευση των συνολικών αριθμών, κάτι που περιπλέκει την αξιολόγηση των ισχυρισμών. Η InterSociety, απαντώντας στην κριτική για την έλλειψη παραπομπών, υποστήριξε ότι «είναι σχεδόν αδύνατο» να αναπαραχθούν όλες οι πηγές που χρησιμοποιεί από το 2010 και ότι η πρακτική της είναι να συγκεντρώνει «στατιστικά σύνοψης» από παλαιότερες έρευνες και να τα συνδυάζει με νεότερα ευρήματα. Το BBC σημειώνει, ωστόσο, ότι οι αναφορές που περιλαμβάνονται στις εκθέσεις της δεν αντιστοιχούν πάντοτε στους αριθμούς που προβάλλονται ως τελικά συμπεράσματα. Νιγηρία: Τι δείχνουν τα στατιστικά για το 2025 Το ίδιο μοτίβο εμφανίζεται κα",
    "fulltext_len": 5000
  },
  {
    "title": "US to limit visas for Nigerian militants",
    "url": "https://www.arkansasonline.com/news/2025/dec/04/us-to-limit-visas-for-nigerian-militants-houthis/",
    "source": "arkansasonline.com",
    "date": "2025-12-04",
    "category": "other",
    "fulltext": "Let us read it for you. Listen now. Your browser does not support the audio element. US to limit visas for Nigerian militants ABUJA, Nigeria -- The United States will restrict visas for Nigerians and their family members responsible for mass killings and violence against Christians, the U.S.... Comments",
    "fulltext_len": 304
  },
  {
    "title": "Bombardements du Nigeria : un œil sur les réserves de pétrole et de minéraux , Donald Trump ordonne de  nombreuses frappes  sur des groupes terroristes",
    "url": "https://www.humanite.fr/monde/donald-trump/bombardements-du-nigeria-un-oeil-sur-les-reserves-de-petrole-et-de-mineraux-donald-trump-ordonne-de-nombreuses-frappes-sur-des-groupes-terroristes",
    "source": "humanite.fr",
    "date": "20251226T133000Z",
    "category": "other",
    "fulltext": "Celui qui s’est lui-même érigé en « président de la paix » a encore frappé. Donald Trump a annoncé, jeudi 25 décembre, que les États-Unis ont mené de « nombreuses » frappes meurtrières contre l’État islamique dans le nord-ouest du Nigeria . « JOYEUX NOËL à tous, y compris aux terroristes morts, qui seront encore plus nombreux si leur massacre des chrétiens se poursuit » , a-t-il publié, en guise d’annonce, sur son réseau Truth Social. Une vidéo d’une dizaine de secondes ensuite postée par le département états-unien de la Guerre semble montrer le lancement, de nuit, d’un missile depuis le pont d’un navire de guerre. « J’avais précédemment prévenu ces terroristes que s’ils n’arrêtaient pas le massacre de chrétiens, ils allaient le payer cher, et ce soir, ils ont payé , a poursuivi Donald Trump. Le ministère de la Guerre a réalisé de nombreuses frappes parfaites. » « Nous avons discuté pendant dix-neuf minutes avant l’attaque » Le Commandement des États-Unis pour l’Afrique (AFRICOM) a de son côté annoncé que plusieurs personnes – présentées comme des terroristes de l’État islamique – avaient été tuées lors de bombardements dans l’État de Sokoto, situé au nord-ouest du pays, à la frontière du Niger . Le chef du Pentagone, Pete Hegseth, s’est enfin dit « reconnaissant pour le soutien et la coopération du gouvernement nigérian » , sur X. Le gouvernement dirigé par Bola Ahmed Tinubu a fourni aux États-Unis des renseignements en amont de ces bombardements. « C’est le Nigeria qui a fourni les renseignements » à Washington, a confirmé le ministre des Affaires étrangères, Yusuf Tuggar, sur ChannelsTV. Ce dernier en a profité pour expliquer avoir « parlé deux fois » avec le secrétaire d’État proche de Trump, Marco Rubio. « Nous avons discuté pendant dix-neuf minutes avant l’attaque, puis nous avons parlé à nouveau pendant cinq minutes avant qu’elle ne commence » , a-t-il annoncé. Yusuf Tuggar a enfin laissé entendre que de nouveaux bombardements pourraient avoir lieu : « C’est un processus en cours, et nous travaillons avec les États-Unis. Nous collaborons également avec d’autres pays. » Selon le journal nigérian Vanguard News , ces premiers bombardements ont visé une « « convergence massive » de terroristes armés et de bandits se déplaçant depuis les corridors sahéliens du Mali et du Burkina Faso, dans l’intention de lancer des attaques coordonnées contre des communautés des États de Sokoto, Zamfara, Niger et Katsina » . « Les autorités nigérianes restent engagées dans une coopération de sécurité structurée avec des partenaires internationaux, dont les États-Unis d’Amérique, afin de lutter contre la menace persistante du terrorisme et de l’extrémisme violent » , déclarait au même moment le gouvernement Tinubu , dans un communiqué. « Les États-Unis cesseront immédiatement toute aide au Nigeria » Le pouvoir nigérian et des analystes indépendants refusent de parler de persécution religieuse ; un argument pourtant rabâché par l’extrême droite chrétienne aux États-Unis, en Europe et par des séparatistes nigérians à l’influence non-négligeable à Washington. Ces assauts marquent ainsi la première intervention militaire dans le pays le plus peuplé d’Afrique de l’administration Trump – qui affirme, sans preuves, que les chrétiens y vivent sous une « menace existentielle » de l’ordre d’un « génocide » . Donald Trump menaçait d’attaquer le Nigeria depuis plusieurs semaines. Le locataire de la Maison Blanche écrivait notamment, en novembre, sur Truth Social : « Si le gouvernement nigérian continue de permettre le meurtre de chrétiens, les États-Unis cesseront immédiatement toute aide au Nigeria et pourraient très bien intervenir dans ce pays désormais déshonoré, armes au poing, pour anéantir complètement les terroristes islamistes qui commettent ces horribles atrocités. » Le gouvernement Tinubu avait alors contesté ces accusations. Alors que le Nigeria est confronté à plusieurs crises, des attaques de Boko Haram et de l’État islamique, en passant par les raids de gangs criminels ou les conflits entre agriculteurs peuls et chrétiens, l’ensemble de la population – musulmans comme chrétiens – est concerné. L’obsession de l’administration Trump à désigner la communauté chrétienne comme seule victime s’inscrit ainsi dans leur projet impérialiste, à la manière des mêmes accusations proférées à l’encontre du gouvernement sud-africain . Le même président états-unien avait, lors de son premier mandat, en 2018, qualifié de « pays de merde » le Nigeria. Loin de se préoccuper de la situation politique sur place, l’ex-magnat de l’immobilier convoite surtout les réserves de pétrole et de minéraux nigérianes. Les États-Unis ont ainsi réinscrit, sous l’impulsion de l’administration Trump , le Nigeria sur la liste des pays « particulièrement préoccupants » en matière de liberté de culte et ont diminué l’octroi de visas à ses citoyens. Drôle de manière d’aider le peuple nigérian. Face à l’extrême droite, ne rien lâcher ! C’est pied à pied, argumen",
    "fulltext_len": 5000
  },
  {
    "title": "Nigerian : 100 kidnapped Catholic school children released",
    "url": "https://www.christianpost.com/news/nigerian-100-kidnapped-catholic-school-children-released.html",
    "source": "christianpost.com",
    "date": "20251208T164500Z",
    "category": "religious",
    "fulltext": "Nigerian authorities secure release of 100 kidnapped Catholic school children By Anugrah Kumar , Christian Post Contributor Monday, December 08, 2025 A signboard for St Mary's Private Catholic Secondary School stands at the entrance of the school in Papiri, Agwarra local government, Niger state, on Nov. 23, 2025. Fifty of the more than 300 children snatched by gunmen from a Catholic school in Nigeria have escaped their captors, a Christian group said in a statement on Nov. 23. \"We have received some good news as fifty pupils escaped and have reunited with their parents,\" said the Christian Association of Nigeria in a statement, adding they escaped between Nov. 21-22. Gunmen raided early Nov. 21 St Mary's co-education school in Niger state in western Nigeria, taking 303 children and 12 teachers in one of the largest mass kidnappings in Nigeria. | Ifeanyi Immanuel Bakwenye / AFP via Getty Images One hundred children kidnapped from a Catholic boarding school in central Nigeria last month have been released by their captors and transported to the capital, authorities confirmed Sunday. The fate of more than 160 other students and staff members abducted in the same attack remains unknown. The mass abduction occurred before dawn on Nov. 21, when armed men stormed St. Mary’s Catholic Primary and Secondary School in Papiri, Niger State, and seized 315 students and staff, most of them children aged between 9 and 14, at gunpoint. On Sunday, Nigerian presidential spokesperson Sunday Dare confirmed 100 of the children had been freed, according to Agence France-Presse . They were flown to Abuja and were expected to be handed over to the Niger State government on Monday. A United Nations source told AFP that arrangements were being made to transfer the children back to state officials. Reports did not specify whether the release was achieved through negotiation, ransom or military intervention, and no information was available on the condition or location of the remaining hostages. Local church officials said they had not yet received formal notification from the federal government. “We have been praying and waiting for their return, if it is true then it is a cheering news,” Daniel Atori, spokesman for Bishop Bulus Yohanna of the Kontagora Diocese, which runs the school, was quoted as saying. Roughly 50 individuals managed to escape shortly after the attack. Officials later estimated that 265 hostages had been taken deep into the forests of north-central Nigeria, where kidnapping for ransom has become widespread. The attack on St. Mary’s was one of several mass abductions reported across Nigeria in November, a month that saw a sharp escalation in armed violence, including the kidnapping of at least two dozen Muslim schoolgirls, 38 church worshippers and multiple attacks on civilians in rural communities. Three days after the Papiri abduction, Anthony Musa, a father of three of the abducted children, died of a suspected heart attack attributed to the emotional toll of the ordeal. Nigeria has struggled to contain the growing threat posed by various armed factions, including jihadist insurgents, criminal gangs and militias. The country’s kidnap-for-ransom crisis has evolved into a structured illicit industry, generating at least $1.66 million between July 2024 and June 2025, according to a report from Lagos-based SBM Intelligence. In response to the security crisis, President Bola Ahmed Tinubu announced a broad expansion of Nigeria’s security forces in late November. He ordered the recruitment of 20,000 new police officers in addition to the 30,000 previously approved, and authorised the hiring of forest guards under the Department of State Services. The Nigerian Senate held an emergency debate during which lawmakers labelled kidnapping a form of terrorism and proposed capital punishment for offenders. Several senators raised alarms over infiltration of the military and police, citing lists of security force recruits containing names of known militants. Rights groups and analysts say a mixture of jihadist actors, bandit gangs and armed Fulani herders are behind the surge in attacks. The World Watch List 2025 report from Open Doors noted that 3,100 of the 4,476 Christians reportedly killed for their faith globally during the review period were in Nigeria. A newly active group known as Lakurawa, believed to be linked to al-Qaeda’s West African affiliate JNIM, has emerged in the northwest. The group is reportedly armed with advanced weaponry and espouses a radical Islamist ideology. In one of the most widely reported incidents last month, Rev. Edwin Achi of the Anglican Diocese of Kaduna was confirmed dead on Nov. 19, nearly a month after being abducted alongside his wife from their home in Nissi, Kaduna State. A ransom demand of 600 million naira, or about $415,000, had been made by the captors. His wife, Sarah, remains in captivity, and their daughter is also missing. U.S. President Donald Trump has accused Nigerian authorit",
    "fulltext_len": 5000
  },
  {
    "title": "Fulani herdsmen kill 12 Christians in central Nigeria",
    "url": "https://www.christiandaily.com/news/fulani-herdsmen-kill-12-christians-in-central-nigeria",
    "source": "christiandaily.com",
    "date": "20260116T001500Z",
    "category": "religious",
    "fulltext": "Christians in Nigeria ask why the Nigeria military does not protect them. U.S. Navy Mass Communication Specialist 2nd Class Sean Castellano Fulani herdsmen killed at least 12 Christians in Plateau state, Nigeria from Jan. 1 to Jan. 9, sources said. In the Gero area of Gyel District in Jos South County, Fulani herders on Friday (Jan. 9) killed one Christian and critically wounded another, said resident Tengwong Yohana Thomas. “Two Christians who are members of our community were attacked by a group of armed Fulani herdsmen in broad daylight,” Thomas told Christian Daily International-Morning Star News. “One of the victims was stabbed to death, while the second victim suffered life-threatening injuries. The injured Christian was receiving hospital treatment, he said. Thomas, head of the Plateau Youth Council Gyel, issued a PYC press statement asserting that the attack once again exposed persistent insecurity threatening peaceful communities in Gyel and surrounding areas. “The PYC Gyel strongly condemns this wicked and inhumane attack on harmless citizens,” he stated. “The continuous targeting of innocent lives is unacceptable and a clear provocation against peace and coexistence in our land.” The PYC called on security agencies to immediately track down and bring the perpetrators to justice, government at all levels to intensify security operations in Gero Gyel and surrounding areas and authorities to take proactive measures to prevent further attacks. The group urged residents to remain calm, vigilant and law-abiding while cooperating fully with security agencies by reporting any suspicious movements or activities. The night of Jan. 7 in predominantly Christian Foron village, Barkin Ladi County, Fulani herdsmen ambushed two Christians who were returning to their village, said community leader Mose Dung. He said Ayuba Choji, 44, was stabbed to death with a knife, while the other Christian was wounded. The attack occurred on the Kumex-Mararaba-Foron axis, he said. “The victim, Ayuba Choji, was stabbed to death by Fulani bandits while riding on a motorcycle with a companion, who survived the assault,” he said. “Prior to the incident, we have been receiving threats from the Fulani bandits warning us to leave our community or they will attack and force us out of the area.” In Riyom County, “Fulani terrorists” on Jan. 6 killed a Christian in an attack shortly before 10 p.m., said community leader Jacob Dawap. “There was a brutal and senseless attack carried out on Wvak village in Jol community, Riyom Local Government Area, at 9:57 p.m. which led to the killing of a Christian, Mr. Pius Luka, 23,” Dawap said. “This unfortunate and barbaric act was carried out by Fulani terrorists.” Chris Giwa, an area political leader, confirmed that the attack killed Luka and was carried out by “Fulani bandits.” “I strongly condemn this senseless violence and express deepest condolence to the bereaved family,” Giwa said. “Such attacks have no place in the society and undermine the peace and stability of Plateau state. I urge the relevant authorities to investigate this incident thoroughly and bring the perpetrators to justice; those responsible must be held accountable.” Also on Jan. 6, another Christian was killed in the Rukuba area of Bassa County by Fulani herdsmen, said resident Daniel Sunday Dodo. “A Christian, Peter Danjuma, was killed by Fulani herdsmen in Kissaloi community in the Rukuba area of Bassa Local Government Area,” he said. “He was killed in the early hours of Tuesday, Jan. 6.” On Jan. 5 in Hwrra village, also in Bassa County, James Jatau was ambushed and killed by Fulani herdsmen along the Zirshe-Maiyanga route, said resident Joseph Chudu Yonkpa. On Jan. 1 in Chugwi village in the Vom area of Jos South County, seven Christians were killed, said Jos-based community activist Rwang Tengwong. “Seven Christian villagers were killed in the early hours of 1 January while celebrating the New Year in Chugwi village of Jos South,” Tengwong said. “The incident occurred at about midnight and was carried out by armed Fulani militants.” The attacks of the new year followed the Dec. 3 kidnapping of the Rev. Ephraim Yakubu from his house in Agingi community, Bassa County by armed Fulanis. The pastor was rescued a day later by military personnel after an extensive operation. More Christians were killed in Nigeria than in any other country from Oc. 1, 2024 to Sept. 30, 2025, according to Open Doors’ 2026 World Watch List. Of the 4,849 Christians killed worldwide for their faith during that period, 3,490 – 72 percent – were Nigerians, an increase from 3,100 the prior year. Nigeria ranked No. 7 on the list of the 50 countries where it is most difficult to be a Christian.",
    "fulltext_len": 4733
  },
  {
    "title": "Can we blame the Nigerian govt now ? 160 Christians kidnapped",
    "url": "https://www.christianpost.com/voices/can-we-blame-the-nigerian-govt-now-160-christians-kidnapped.html",
    "source": "christianpost.com",
    "date": "20260129T120000Z",
    "category": "religious",
    "fulltext": "Can we blame the Nigerian gov't now? 160 Christians kidnapped while in churches By Sam Jones , Op-ed contributor Thursday, January 29, 2026 Funeral of Christians killed on Aug. 28, 2025, in Kauru County, Kaduna state, Nigeria. | Iliya Tata for Christian Daily International-Morning Star News Armed terrorists stormed three churches in Kaduna State, Nigeria, on Sunday morning, Jan. 18, and abducted at least 160 Christian worshipers in the middle of their services. They were taken during worship services, marched into nearby forests, and forced toward known terrorist enclaves. And none of this should have surprised anyone. One week earlier, TruthNigeria issued a terror alert warning that the Kurmin Wali corridor was facing imminent danger. The area lies within miles of established hostage camps long operated by Fulani Ethnic Militia and allied terrorist groups — camps that have held hundreds of captives for years, documented through survivor testimony, video interviews, and geolocation data. The threat was known. The terrain was mapped. The pattern was established. And yet, when armed Fulani Ethnic Militia walked into three churches and carried out one of the largest mass church abductions in Kaduna’s history, the government did not respond with urgency. It responded with denial. For two days, local authorities denied that any mass kidnapping had occurred at all. While families searched for loved ones, officials rejected the reports outright. Only after TruthNigeria published detailed documentation of the attack did the government abandon its denial and acknowledge that the abductions had taken place. That sequence matters because this was not an unforeseeable tragedy. There was warning of the attacks in a documented terror corridor near permanent hostage camps. And when it happened, the first instinct of the state was not protection — it was suppression. This is not merely failure; It is a pattern. Nigeria has become the deadliest country in the world to be a Christian. For more than a decade, violence linked to Fulani Ethnic Militia and allied jihadist groups has followed a grim and familiar arc: intelligence warnings ignored, attacks denied, language softened, perpetrators left untouched, and then quiet normalization. Churches are burned. Villages are massacred. Worshippers are abducted. And each time, the response follows the same script: minimize, reframe, delay. Eyewitnesses from Kurmin Wali describe gunmen bursting into services, ordering worshippers to lie down or be killed. Some wore black robes and turbans. Others wore Nigerian Army-style camouflage. The attackers coordinated strikes on three churches simultaneously, then marched captives toward forests that security officials know well. This was not a random crime. This was not opportunistic banditry. This was a coordinated operation by armed Fulani Ethnic Militia in territory already identified as high risk. This raises an unavoidable question: How does an attack of this scale occur – in a warned-of zone, near permanent hostage camps – without either catastrophic incompetence or quiet tolerance? That question becomes harder to avoid when those camps remain untouched year after year in the age of drones and satellite surveillance, ransom economies flourish openly, kidnappers operate within miles of security corridors, and victims are marched through territory no one seems willing to secure. At some point, failure ceases to be accidental. Governments are judged not only by what they prevent, but by what they permit — and by what they refuse to acknowledge. And this refusal is reinforced by the language the world continues to use. Western institutions describe Nigeria’s violence as “complex,” “ethnic,” or “tribal,” but complexity does not explain why churches are targeted. Ethnicity does not explain why worship services are raided. Tribal conflict does not explain coordinated multi-church operations carried out by armed militia groups with ideological motives. What explains it is persecution — tolerated, or aided and abetted, by a state that denies it, delays it, and declines to confront it. The men and women taken from those churches were not casualties of chaos. They were victims of terror in a territory their government had been warned about and failed to secure. The world does not get to call that “complex.” It must call it what it is. And Nigeria’s government must now answer the question it has avoided for too long: How many warnings must be ignored, how many churches must be burned, and how many Christians must be taken before this is no longer negligence — but complicity? Pastor Sam Jones serves Abundant Life Christian Fellowship in Humboldt, IA as Senior Pastor. He married the love of his life, Sarah, in 2013; they have two sons, Thomas and Henry. He is most known for his teachings on the 4 spheres of delegated government and for being a voice for the pre-born. In addition to his Pastoral schedule, Pastor Sam is an avid podcaster and has been k",
    "fulltext_len": 5000
  },
  {
    "title": "Trump’s Remarks Ignite Hope for Nigerian Christians — but Reality on Ground Remains Deeply Complex",
    "url": "https://www.ncregister.com/news/trump-s-remarks-ignite-hope-for-nigerian-christians",
    "source": "ncregister.com",
    "date": "2025-11-07",
    "category": "religious",
    "fulltext": "President Donald Trump’s vigorous defense of Nigerian Christians has been widely welcomed by Christian and human-rights groups involved in the country, even if sources on the ground stress that the reality is complex and that Islamist attacks on Christians, while significant, are part of a wider and multifaceted problem. In a video published on his Truth Social account Nov. 5, President Trump said Christianity is “facing an existential threat” in the West African nation, adding that “thousands and thousands of Christians are being killed” and that “radical Islamists are responsible for this mass slaughter.” Trump went on to say that the United States “cannot stand by while such atrocities are happening in Nigeria and numerous other countries.” He also threatened to use force and to enter the “now-disgraced country guns-a-blazing,” as well as impose economic sanctions and withhold aid if action is not taken to protect the Christians there. On Oct. 31, Trump acted to designate Nigeria a “Country of Particular Concern” (CPC), meaning it would henceforth be held responsible for particularly severe violations of religious freedom under the 1998 U.S. International Religious Freedom Act. Trump has also asked U.S. Rep. Riley Moore, R-W. Va., to lead an immediate investigation into the extent and nature of the persecution. So far this year, according to reports , more than 7,000 Christians have been killed, averaging 30 to 35 deaths daily, mostly attributed to Islamist Boko Haram and Fulani herdsmen, as well as militants linked to the Islamic State West Africa Province (ISWAP). At least 17 Christians were killed hours after Trump announced the CPC designation, murdered overnight by suspected Islamic Fulani militias on the Plateau-Kaduna border, the advocacy group Persecution.org reported . According to a report published in March by the Vatican’s Fides Agency, a total of 145 priests were kidnapped and 11 were killed in Nigeria between 2015 and 2025. Three had been killed by March this year alone. On Sept. 19, Father Emmanuel Asadu, director of communications for the Nsukka Diocese, was shot while returning to his parish after a pastoral assignment. Responding to Trump’s remarks, Christian Solidarity Worldwide (CSW), a U.K.-based human-rights foundation, said Thursday it believed Trump’s recent words and actions on Nigeria, especially his decision to designate it a CPC, would help tame the ongoing persecution of Christians in the West African nation. The charity Aid to the Church in Need also welcomed the CPC designation, saying in a statement sent to the Register that the move “underscores the severe challenges” facing Nigeria’s Christians, who, for many years, have “endured profound suffering from religious persecution and targeted criminal violence, which have shattered their lives and communities.” Bishops Mixed The charity, however, was at pains not to interfere with the bishops’ own views on the matter, which are mixed. Some, such as Bishop Wilfred Anagbe of Makurdi in Nigeria’s Middle Belt region, a focal point of the Islamist violence (although Makurdi itself is 95% Christian), have publicly supported the CPC designation, viewing it as long overdue and hoping it will pressure the Nigerian government to take action. Bishop Anagbe recently visited the U.S. to lobby for such a measure. Others, such as Bishop Matthew Hassan Kukah of Sokoto, a diocese that has endured persecution, have urged caution , warning that the designation may complicate efforts for interreligious dialogue and create new tensions within Nigeria. ACN-USA spokesman Edward Clancy noted to the Register that many Nigerian bishops are also “isolated and so don’t necessarily witness the same thing,” leading them to take different approaches to Trump’s measures. Most Nigerian Muslims live in the country’s northern region, making up roughly half the nation’s 230 million people, while Christians, accounting for 35% to 50% of Nigeria’s population, mostly live in the south. For its part, Nigeria’s government has responded defensively and critically to Trump’s words and actions. President Bola Tinubu’s administration has insisted that violence in Nigeria is not a campaign targeting Christians, but rather the result of complex security challenges, with both Christians and Muslims suffering attacks. Some analysts contend that the violence in Nigeria is terrorism rather than persecution, perpetrated by militant groups who also attack Muslims and those of other faiths. Nigerian authorities have also criticized the CPC designation, arguing that it fails to accurately reflect the situation on the ground and could undermine ongoing efforts to foster interreligious peace and counter insurgency. Officials have said Nigeria welcomes international cooperation against terrorism and violence — provided it respects the country’s sovereignty and is conducted in partnership, not through coercion. Clancy stressed that the persecution against Christians can be divided in",
    "fulltext_len": 5000
  },
  {
    "title": "Beyond the headlines : What the vidence shows about anti - Christian violence in Nigeria",
    "url": "https://www.christiandaily.com/news/beyond-the-headlines-what-the-vidence-shows-about-anti-christian-violence-in-nigeria",
    "source": "christiandaily.com",
    "date": "20251222T160000Z",
    "category": "religious",
    "fulltext": "Screenshot from a video shows armed militants in Nigeria. The extremist group Boko Haram, along with Islamic State affiliates and Fulani militant herders, has been responsible for widespread attacks on Christian communities. Youtube Screenshot / Boko Haram: Black Terror in Africa When U.S. President Donald Trump redesignated Nigeria as a Country of Particular Concern (CPC) in late October 2025, few anticipated the fierce debate that would follow. Trump declared that Christians face systematic persecution in the country and accused the Nigerian government of failing to address the crisis. Disagreement erupted over whether Islamic militant forces deliberately target Christians or whether the violence stems from broader security failures. Voices joined the debate even after the U.S. threatened action against Nigeria. While the controversy has intensified over the last three months, accounts from Nigerians on the ground now reveal decades of incidents that have escalated into the brazen violence and kidnappings plaguing parts of the country, particularly in the Middle Belt and northern regions. A webinar organised by Open Doors International on Dec. 16 examined the claims and counterclaims of deliberate Christian persecution from the lens of people at the frontline. Jabez Musa (pseudonym), a human rights lawyer and seasoned journalist explained, that the conflict in Nigeria, which has come to be known as “persecution of Christians,” started in 1999, when Sharia (Islamic law) took effect in most northern states. “This [Sharia law] conflicts with Nigeria's constitution, which prohibits state religion. Today, 12 northern states operate under Sharia law,\" Musa noted. Open Doors has documented numerous attacks targeting Christians in several countries, including Nigeria. Research from Open Doors on these attacks prompted the U.S. government to focus attention on the country. The emergence of Boko Haram in 2009, an Islamic militia front, marked a turning point for the country—violence that would eventually strike close to home for Musa. Since then, numerous violent extremist groups have surfaced, including Fulani militants, the Islamic State-West Africa Province, Lakawara, and Mahmuda. \"Boko Haram amplified the ideology of Sharia and Islam. The group's brutal tactics, bombings, kidnappings, abductions, rape, forced marriages, and killings, have disproportionately affected Christians and other vulnerable groups,\" Musa emphasized. Musa explained that Boko Haram rejects anything Western, particularly education. The group views Christianity as Western culture that must be eliminated. The northeast serves as its epicenter, where conservatively over 50,000 Christians have died since the group emerged, with many displaced or forced to flee the region. \"Nigeria has dominated headlines for 20 years or more,” observed Steven Kefas, founder of Middle Belt Times and senior research analyst at the Netherlands-based Observatory for Religious Freedom in Africa (ORFA), an organization that monitors religious violations across Africa. “Most recently, in late October, the conversation gained momentum with the country's redesignation as a Country of Particular Concern.\" He contributed his opinion and experience during the webinar after conducting investigative reporting that sparked significant reforms in Nigeria. His experience gathering reports on the ground convinced him that what unfolds in parts of the country represents targeted persecution against Christians. \"As someone who has worked on the ground for at least 15 years, reporting on most of these atrocities, I can state with complete responsibility that Christians face persecution in Nigeria,\" he affirmed. \"For instance, in the Middle Belt, where I've lived my entire life, other faiths exist. But when you examine the pattern of violence in the Middle Belt, only one faith – the Christian faith – faces targeting.\" In a July report by ORFA , Kefas highlighted a paradox regarding the visibility of these dangerous groups. “In 2015, when the Global Terrorism Index (GTI) ranked Armed Fulani militants as the fourth deadliest terror group in the world, Nigeria already grappled with multiple brutal security threats,\" he wrote. \"Yet, nearly a decade later, these same militants have grown exponentially more lethal. They have mysteriously vanished from international terrorism rankings, despite becoming what many security experts now consider Nigeria's deadliest non-state armed group.” Violence against Christians or communities? Amid the arguments, some Nigerian government officials deny that attacks target one faith. They claim all religions suffer under what they describe as terrorist attacks. In November, Minister of Information and National Orientation Alhaji Mohammed Idris dismissed any faith-related dimension to the attacks. The Vanguard news outlet in Nigeria quoted the minister stating that terrorism-related attacks on Nigerians, regardless of faith and political affiliations, have ",
    "fulltext_len": 5000
  },
  {
    "title": "Rights group criticizes Bishop Kukah over comments about genocide in Nigeria",
    "url": "https://www.catholicworldreport.com/2025/12/09/rights-group-criticize-bishop-kukah-over-comments-about-genocide-in-nigeria/",
    "source": "catholicworldreport.com",
    "date": "20251210T001500Z",
    "category": "religious",
    "fulltext": "Bishop Matthew Hassan Kukah of Sokoto, Nigeria, gestures during a 2016 interview with Catholic News Service in Washington. (CNS photo/Bob Roller) The Executive Director of the International Society for Civil Liberties and the Rule of Law (Intersociety), Emeka Umeagbalasi, has strongly criticized Bishop Matthew Hassan Kukah, questioning the cleric’s impartiality in addressing claims of a Christian genocide in Nigeria. In exclusive comments to CWR, Umeagbalasi challenged Kukah’s claim that statistics on Christian persecution are unverified. He presented what he termed a “mountain of evidence” from various dioceses and international bodies. The fiery response comes after Bishop Kukah, a prominent voice in Nigeria, dismissed claims of a coordinated genocide against Christians. Speaking at the Vatican on October 21 during the launch of Aid to the Church in Need’s Religious Freedom in the World Report 2025, which effectively spotlights Nigeria as one of the worst places to live in for a Christian, Kukah failed to denounce the suffering of Christians in Nigeria. Instead, the Bishop of Sokoto said Nigerians of all stripes suffer, due mainly to insecurity and state weakness. “If we were dealing with outright persecution of Christians on grounds of identity, both myself and my small flock would not exist,” Kukah said, explaining that he travels freely in the northwestern Nigerian state, with no one troubling him because of his faith. Sokoto is a largely Muslim area. “By whatever names we choose, the fact is that Nigerians are dying unacceptable deaths across the country. In many cases, they are targeted because of their beliefs but also because of their ethnicity. We are in the cusp of a weak state with a clear lack of capacity to arrest the descent into anarchy.” Speaking on Friday, November 28, at the 46th Supreme Convention of the Knights of St. Mulumba (KSM) in Kaduna, Kukah doubled down on his denial of a Christian genocide in Nigeria. “People say there is genocide in Nigeria,” stated Kukah. “My argument is that it is not accurate to claim there is genocide or martyrdom in Nigeria,” noting that Muslims are also killed by extremists. He questioned data that have been advanced to justify claims of genocide in the African country. “They are saying that 1,200 churches are burnt in Nigeria every year, and I ask myself, in which Nigeria? Interestingly, nobody approached the Catholic Church to get accurate data.” “We do not know where these figures came from. All those talking about persecution; has anyone ever called to ask, ‘Bishop Kukah, what is the situation?’ The data being circulated cleverly avoids the Catholic Church because they know Catholics do not indulge in hearsay.” The cleric then proceeded to explain the meaning of “genocide,” saying that it is not based on the number of people killed. “You can kill 10 million people and it still won’t amount to genocide,” he said. “The critical determinant is intent; whether the aim is to eliminate a group of people. So, you don’t determine genocide by numbers; you determine it by intention. We need to be more clinical in the issues we discuss.” Kukah: A compromised Bishop? In comments to CWR, Emeka Umeagbalasi, the executive Director of Intersociety, questioned Bishop Kukah’s standing to speak for the Catholic Church in Nigeria. “Who the hell is he? Is he the owner of the Catholic Church?” Umeagbalasi queried, describing Kukah’s diocese in Sokoto as “one of the smallest” and “not even an archdiocese.” He argued that the laity, not the clergy, are the true owners of the Church, and that Kukah speaks only for his own small flock, which he alleged is “nearing the nadir of emptiness.” The core of Umeagbalasi’s argument centered on what he claims is a betrayal by a clergyman who has become compromised by his ties to the government. He highlighted Kukah’s recent appointment as Pro-Chancellor of a university in Kaduna, labeling him a “Nigerian government appointee.” “If somebody is a federal government appointee, the person has robbed himself of independent mindedness, and the person has also robbed himself of sound and neutral judgment,” Umeagbalasi stated. He claimed that instead of maintaining silence on critical national issues, Kukah is now “speaking in defence of the government.” The evidence To counter Kukah’s “no statistics” claim, the Intersociety director reeled off a barrage of figures and incidents from across the country. In the Diocese of Bukuru, Umeagbalasi cited a report by the local bishop, which states that “355 churches have been lost to foreign jihadists” between 2015 and 2025. He said an estimated 400 Christian villages have been uprooted in southern Taraba alone. In the Diocese of Maiduguri, Umeagbalasi referenced the local bishop’s testimony to the UK Parliament that over 215 churches were destroyed by Boko Haram and jihadists as of 2017, displacing 1.8 million people, predominantly Christians, from southern Borno. Umeagbalasi provided stark statistics",
    "fulltext_len": 5000
  },
  {
    "title": "Massacre of Christians ongoing in Nigeria as Fulani kill 13",
    "url": "https://www.christianpost.com/news/fulani-herdsmen-kill-13-christians-in-central-nigeria.html",
    "source": "christianpost.com",
    "date": "20260113T184500Z",
    "category": "religious",
    "fulltext": "Massacre of Christians ongoing in Nigeria: 'Fulani herdsmen killing innocents almost daily' Fulani herdsmen killed 13 Christians in Benue State, Nigeria. Four Christians were shot in their homes on January 1, and nine others were killed on January 5-6. Residents report ongoing violence and missing persons following the attacks. ABUJA, Nigeria — Fulani herdsmen in Benue state, Nigeria, killed four Christians on Monday and nine others on Jan. 5-6, sources said. Ochi Igbade, one of the four Christians killed in attack on Otobi Akpa village, Benue state, Nigeria, on Jan. 12, 2026. | Facebook In Otobi Akpa village, Otukpo County, Fulani herdsmen arrived at midnight on Monday and shot four Christians who had been asleep in their homes, said resident Franca Akipu, who said dozens of others remain missing. “The attack was carried out by Fulani herdsmen,” she told Christian Daily International-Morning Star News . “They shot at people who were sleeping. The gunshots were so loud that my mom was in panic throughout the night. Please keep my community in your prayers.” Akipu identified the slain Christians as Ochi Igbade, Eje Uzu, Alinko and Achibi. Previously, Fulanis had attacked the village on April 15, killing 13 Christians and burning down 50 houses, she said. Community leader Adikwu Ogbe said they were attacked at about 6 p.m. on that day. “The armed herdsmen invaded our community, shooting sporadically at anyone they sighted,” Ogbe told Christian Daily International-Morning Star News. “And when they retreated, 13 of our Christian members had been killed, while 50 houses were destroyed.” In two other counties in Benue state, herdsmen killed five Christians on Jan. 6 and four others on Jan. 5, residents said. In Kwande County, Fulani herdsmen on Jan. 6 killed five Christians as they were working on their farms in Udeku Maav-Ya village at about 4 p.m. “This incident is not the first in this area, as these Fulani herdsmen have been persistent in attacking our communities,” said Tersua Yarkwan, chairman of the Kwande Local Government Council. Council member Akerigba Lawrence also noted that residents of the area’s predominantly Christian villages “have constantly faced sustained attacks and destruction of their homes and farms.” In Ikyaghev village, Guma County, herdsmen on Jan. 5 killed four Christians, said Maurice Orwough, Guma Council chairman. “The farmers were working on their farms when the herdsmen attacked them around 10 a.m.,” Orwough told Christian Daily International-Morning Star News. “The four Christians are members of the same family.” James Melvin Ejeh, Agatu Council chairman, said there have been “deliberate and systematic attacks against Christians in some of our communities by herdsmen which have resulted in loss of lives and destruction of property.” In Ukum County, armed herdsmen on Jan. 8 attacked farmers in predominantly Christian Adogo village, destroying crops, said resident Thomas Ikyase. Community leader Aule Gba added, “Farmers in my community were attacked by Fulani terrorists. They forced our people to flee from their homes.” Herdsmen attacks also took place in December. In Okpokwu County, Fulani herdsmen on Dec. 30 attacked a funeral in Owewe village, said resident Isaac Audu. Sunday Oche, chairman of the Ado Local Government Council, noted that herdsmen also attacked the predominantly Christian villages of Ijigban, Ulayi and Utonkon on Dec. 9. “The herdsmen’s pattern of violence includes attacking mourners, ambushing farmers, and inflicting machete cut wounds on Christian victims,” Oche said. In an attack on predominantly Christian Mbamondo Ukembergya village in Logo County on Dec. 7, herdsmen killed four Christians, said resident Simon Chia. “Fulani herdsmen are killing innocent Christians almost daily,” Chia said. “This is the situation we are facing in Logo Local Government Area of Benue state.” Numbering in the millions across Nigeria and the Sahel, predominantly Muslim Fulani comprise hundreds of clans of many different lineages who do not hold extremist views, but some Fulani do adhere to radical Islamist ideology, the United Kingdom’s All-Party Parliamentary Group for International Freedom or Belief (APPG) noted in a 2020 report . “They adopt a comparable strategy to Boko Haram and ISWAP and demonstrate a clear intent to target Christians and potent symbols of Christian identity,” the APPG report states. Christian leaders in Nigeria have said they believe herdsmen attacks on Christian communities in Nigeria’s Middle Belt are inspired by their desire to forcefully take over Christians’ lands and impose Islam, as desertification has made it difficult for them to sustain their herds. This article was originally published at Christian Daily International – Morning Star News",
    "fulltext_len": 4787
  },
  {
    "title": "World Watch List 2026 : Syria again among 10 worst countries for Christians",
    "url": "https://www.christiandaily.com/news/world-watch-list-2026-syria-again-among-10-worst-countries-for-christians",
    "source": "christiandaily.com",
    "date": "20260114T141500Z",
    "category": "religious",
    "fulltext": "ALEPPO, SYRIA — Syrian army soldiers are seen in the Sheikh Maqsoud neighborhood after clashes with Kurdish fighters in January 2026. Persistent violence and instability have driven Syria back into the top 10 countries where Christians face the most severe persecution, according to Open Doors’ 2026 World Watch List. Adri Salido/Getty Images Syria broke into the top 10 countries where it is most difficult to be a Christian for the first time in nearly a decade in Open Doors’ 2026 World Watch List (WWL) as more than 388 million Christians worldwide faced high levels of persecution or discrimination last year. “The intensity of persecution and discrimination continues to increase, with more than 388 million Christians worldwide, one in seven, facing high levels of persecution and discrimination for their faith,” the WWL report states. “This accounts for 8 million more people than last year.” Facing at least high levels of persecution or discrimination for their faith are one in five Christians in Africa; two in five Christians in Asia; and one in 12 in Latin America. With a surge of anti-Christian violence, Syria vaulted from No 18 in 2025 to No. 6 in the 2026 report released today (Jan. 14). “It is the only newcomer to the Top 10. The biggest reason was a sharp, 9-point increase in the score for violence,” the WWL report states, noting that Syria’s violence score – with a maximum possible 16.7 – jumped from seven the prior year to 16.1 in this year’s report, which covers the period from Oct. 1, 2024 to Sept. 30, 2025. Syria’s overall persecution score jumped from 78 to 90, its highest ever. “The 12-point jump is among the largest single-year increases registered by any country under the World Watch List methodology in place since 2014,” the report states. “A surge of violence returns the country to the top 10, and the Christian population continues to diminish.” In the absence of reliable statistics, Open Doors estimates about 300,000 Christians remain in Syria today, hundreds of thousands fewer than 10 years ago. Their dwindling number leaves them more vulnerable. Tribal affiliations that provide some measure of protection amid the absence of state-provided security is unavailable to many native Christians and nearly all converts. “Throughout the country tribalism, intertwined with Islam, considers conversion from Islam to Christianity treason, leading to fierce opposition from families and local leaders,” the report noted. At least 27 Syrian Christians were killed for their faith during the reporting period, but the report noted that the true number likely is greater. “In the previous 12 months, the total was zero,” it noted. “This, combined with an increase in attacks on churches and forced closures of Christian schools, explains the sharp rise in the country’s violence score.” Following the fall of the regime of Bashar al-Assad in December 2024, in June 2025 a suicide attack attributed to an Islamic State cell during services at Mar Elias Greek Orthodox Church in Damascus killed 22 Christians and wounded 63. The attack prompted many Christians to stop attending services and churches to curtail their activities, according to the report. “In December 2024, the Assad regime fell, the jihadist group Hay’at Tahrir al-Sham, or HTS, took control of the government, and the situation for Christians once again changed dramatically,” the report noted. Violence was not the only reason for Syria’s fall in the rankings. The March 2025 interim constitution centralizes power in the president and establishes Islamic jurisprudence as the main source of legislation. “At this still-early post-Assad stage, political power remains fragmented, and the widespread disorder leaves room for radical and militant actors to target Christians, which has resulted in increasing pressure in other areas of Christian life aside from violence,” the report states. Throughout the country, Christians feel the impact of HTS rule. “The law gives little recognition to Baptist, Evangelical and Pentecostal congregations, exposing them to significant pressure because of the popular perception that they evangelize Muslims and are sympathetic to the West,” the report states. “The historical Orthodox Church is not free of risk, either, because of its perceived ties to the previous regime.” At the same time, the government is reforming education according to Islamic ideology – eliminating pre-Islamic history, removing female figures and incorporating Quranic interpretations that, for example, describe Jews and Christians as “those who are damned and have gone astray,” according to the report. Worst 10 As in the prior year, the three countries where it was most difficult to be a Christian were North Korea, Somalia and Yemen in that order. In fourth place Sudan replaced Libya, which rose to No. 9. Eritrea went from No. 6 to No. 5, and Nigeria remained the same as the prior year at No. 7. Pakistan remained at No. 8 and, with Libya at No. 9, Iran went from n",
    "fulltext_len": 5000
  },
  {
    "title": "Nigeria : Anxiety As U . S . Vows More Airstrikes On Terrorist Camps in Nigeria",
    "url": "https://allafrica.com/stories/202512270035.html",
    "source": "allafrica.com",
    "date": "20251227T064500Z",
    "category": "analytical",
    "fulltext": "Ex-generals, experts welcome action, Gumi kicks | Strikes targeted terrorists, not religion - Presidency The December 25, 2025 commencement of bombings by the United States and its allies to root out terrorists in northern Nigeria has triggered uncertainty and excitement. However, many have expressed concern over the far-reaching implications of this military campaign being carried out in collaboration with the Nigerian government. Already, there are mixed feelings in the country, even as experts in international relations blamed the US action on the inability of the Nigerian government to tackle the rising incidents of terrorism and violent extremism that have killed tens of thousands of people in the last decade. Follow us on WhatsApp | LinkedIn for the latest headlines US President Donald Trump described the bombing that started in Sokoto State as powerful and deadly, warning that he would intensify the bombing if the killing of Christians by Islamic State (IS) terrorists continues. He said, \"Tonight at my direction as commander-in-chief, the United States has launched a powerful and deadly strike against ISIS terrorist scum in North West Nigeria, who have been targeting and viciously killing, primarily innocent Christians, at levels not seen for many years and even centuries. \"I had previously warned these terrorists that if they did not stop slaughtering Christians, there would be hell to pay and tonight there was. The Department of War executed numerous perfect strikes, as only the United States is capable of doing. \"Under my leadership, our country will not allow radical Islamic terrorism to prosper. May God bless our military and Merry Christmas to all including the dead terrorists, of which there will be many more if their slaughter of Christians continues.\" Trump's statement was corroborated by the United States Africa Command (US-AFRICOM), which said, \"At the direction of the President of the United States and the Secretary of War, and in coordination with Nigerian authorities, the US Africa Command conducted strikes against ISIS terrorists in Nigeria on December 25, 2025 in Sokoto State.\" The situation has become dicey for Nigeria as experts try to dissect the greater implication, with long-time American ally in the Middle East - Israel - also joining in the fray. Israel Prime Minister Benjamin Netanyahu, in his Christmas message, categorically asserted that the killing of Christians in Nigeria 'must stop now.' The Nigerian government appears to have solidified the US position when it issued a statement on Boxing Day confirming and backing the US action, describing it as a collaborative effort between both governments to tackle terrorism in Nigeria. Spokesman of the Nigerian Ministry of Foreign Affairs, Kimiebi Ebienfa, issued a statement on Friday December 26, 2025, which revealed that Nigerian authorities were engaged in structured security cooperation with international partners, including the United States of America, in addressing the persistent threat posed to the country by terrorists and violent religious extremists. \"This has led to precision hits on terrorist targets in Nigeria by air strikes in the North West,\" the statement said. It noted that in line with established international practice and bilateral understandings, this cooperation includes the exchange of intelligence, strategic coordination, and other forms of support consistent with international law, mutual respect for sovereignty, and shared commitments to regional and global security. Nigeria, however, stated that all counter-terrorism efforts are guided by the primacy of protecting civilian lives, safeguarding national unity, and upholding the rights and dignity of all citizens, irrespective of faith or ethnicity. \"Terrorist violence in any form whether directed at Christians, Muslims, or other communities remains an affront to Nigeria's values and to international peace and security, \"the statement added. The federal government also vowed to continue working closely with its partners through established diplomatic and security channels to weaken terrorist networks, disrupt their financing and logistics, and prevent cross-border threats, while strengthening Nigeria's own security institutions and intelligence capabilities. \"The Ministry of Foreign Affairs will continue to engage relevant partners and keep the public informed through appropriate official channels, \"the statement added. Speaking to our correspondent on Friday, public intellectual, Dr. Katch Ononuju, said although the US and Israel have their own agenda in Nigeria, the air strikes are necessary to send a message to the terrorists and their backers that they cannot continue to kill and displaced people especially Christians in their communities in Nigeria. Ononuju blamed some unamed Fulani elite for bringing this situation on Nigeria by perpetuating unabated killings in the country even as he warned that it has a far more international coloration than Nigeria",
    "fulltext_len": 5000
  },
  {
    "title": "US strikes on IS targets in Nigeria may only fan the flames of insurgent violence",
    "url": "https://www.theguardian.com/commentisfree/2025/dec/28/us-strikes-nigeria-donald-trump-crusader-terrorism-is-targets",
    "source": "theguardian.com",
    "date": "2025-12-28",
    "category": "analytical",
    "fulltext": "T he response of Nigerians to the airstrikes against Islamic State (IS) targets in Sokoto state, north-western Nigeria are complicated. The rationale behind them has been widely opposed, but the strikes themselves have been welcomed. The airstrikes were framed as a response to what have been described as genocidal attacks on Christians in the country. But the Nigerian authorities have consistently rejected this narrative, arguing that armed groups in the country do not discriminate based on religion, and that Christians and Muslims largely coexist peacefully. Ironically, it was Trump’s redesignation of Nigeria as a “ country of particular concern ” in November that deepened Muslim-Christian tensions. Many northerners, who are predominantly Muslim, blamed southern Nigerians for championing a narrative that ultimately resulted in US sanctions and international stigma. The geographic and operational focus of the strikes has complicated the “Christian genocide” framing. Sokoto is the spiritual heartland of Islam in Nigeria, but armed violence in the area disproportionately affects Muslim communities. By contrast, attacks against Christian farmers are most prevalent in north-central states such as Benue and Plateau, where violence is often linked to armed Fulani herders rather than explicitly jihadist groups. The strikes targeted IS elements, not herder militias. While some reports suggest tactical collaboration between jihadist groups in the north-west and armed herders, the mismatch between the stated justification and the operational target raises questions about whether Washington fully understands the local drivers of violence it has labelled genocidal. Despite there being opposition to – and confusion over – the rationale behind the strikes, they have been broadly welcomed, cutting across religious, ethnic and social divides. Earlier fears were shaped by the spectre of the prolonged US occupations in Libya, Iraq, Syria and Afghanistan, cases frequently cited in Nigerian media. By contrast, the Sokoto operation was a limited, targeted precision strike. Moreover, there have so far been no credible reports of civilian casualties, alleviating a major concern in a country where Nigerian air force operations have, on several occasions, accidentally killed hundreds of civilians. The strikes against IS came at a time of public fatigue with insecurity caused by insurgency, terrorism, banditry and communal violence. Nigerians were ready to accept almost any intervention that promised relief. As terrorist networks become increasingly interconnected across the Sahel and West Africa, Nigerian security forces have become overstretched. Persistent corruption, inadequate training and equipment shortages continue to undermine counterinsurgency efforts. In some theatres, groups such as Boko Haram and its splinter factions now wield more sophisticated weaponry than state forces. The Nigerian authorities have confirmed that they endorsed the operation . The minister of foreign affairs, Yusuf Tuggar, acknowledged that Abuja provided intelligence that enabled the strikes and Nigerian officials remained in communication with US forces until minutes before execution. This joint counter-terrorism action, rather than a unilateral violation of Nigerian sovereignty, eased concerns about territorial integrity and external military overreach. Despite the support, Nigeria’s insecurity will not be resolved through airpower alone. Airstrikes may yield short-term tactical gains, but they risk generating longer-term strategic setbacks. Framing the intervention as the defence of persecuted Christians may strengthen extremist narratives of foreign “crusader” aggression, potentially attracting more external funding and support for jihadist groups. Organisations such as Isis-Sahel and emerging groups such as Lakurawa thrive on such symbolism. The durable solution lies in starving violence of its fuel by addressing its structural drivers: deep socioeconomic inequality (Sokoto has one of the highest numbers of out-of-schoolchildren in Nigeria), desertification and climate stress, weak state presence in rural areas, porous borders and fragile security institutions. Strengthening state capacity to manage grievances, regulate competition over land and resources, and counter extremism remains the only sustainable path to peace. Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here .",
    "fulltext_len": 4570
  },
  {
    "title": "Nigeria : A Mirage of Extraversion - The Political Cost of Nigeria Lobbying Deal",
    "url": "https://allafrica.com/stories/202601270690.html",
    "source": "allafrica.com",
    "date": "20260127T193000Z",
    "category": "analytical",
    "fulltext": "The Nigerian government has recently engaged the services of a Washington-based lobbying firm to promote its efforts at protecting the lives of Nigerians against terrorists, particularly Christians. This comes amid Nigeria's security crisis, which has moved from a domestic struggle to a theatre of direct American military intervention. In November 2025, President Trump issued a blunt warning to launch an attack in Nigeria \"guns-a-blazing\" if the government failed to stop the killing of Christians by Islamist groups . This diplomatic tension culminated in December 2025 with US missile strikes in Sokoto, an action the White House described as a \"Christmas gift\" to terrorists. Abuja described these attacks as a \"joint operation\" against armed groups. However, the strikes were presented by Washington as a unilateral move to save the Christian community from persecution. The lobbying deal reportedly costs US$9 million, approximately 12 billion Naira. Government officials justify this arrangement by arguing that it will help improve Nigeria's international image. They claim it will offer better perspectives on the government's efforts at a time when global attention on the country has intensified. Yet the more fundamental question remains: what does this deal mean for Nigeria, and what impact does it have on the peace and security of the thousands of people who continue to die in rural communities? Government spokespeople and supporters argue that the lobbying effort is apt given Nigeria's current security realities. They point to the ongoing international debates about Christian genocide in the North, which has led to the designation of the country as a particular concern. For them, US$9 million is not so much to invest in the country's international reputation. With this deal, the US firm is expected to engage with and influence US authorities to position Nigeria more favourably in the eyes of the American government and its stakeholders. Follow us on WhatsApp | LinkedIn for the latest headlines While the government's position may seem to make sense on the surface, its actions do not address security or the internal challenges that led to the commissioning of a US firm for what many see as image laundering. Investing 12 billion Naira in a foreign firm confirms a breakdown of trust between the Nigerian government and its citizens. It also indicates a disconnect between Abuja and Washington. It serves as the government's acknowledgement that the US authorities do not trust their stories or their efforts to combat insecurity. More importantly, it shows how the Nigerian government misunderstands the conflict as a discourse issue that can be solved through information and communication strategies. This pattern reveals what Jean-François Bayart describes as the mirage of extraversion, where external validation is pursued to compensate for fragile domestic legitimacy. African elites have, in recent years, exhibited this tendency, looking outward to global powers for validation because they have failed to secure a genuine mandate or trust at home. By paying 12 billion Naira to a US firm to communicate its efforts, the government trivialises the actual problem. Those who insist on the narratives of Christian genocide did not wake up to sell a story out of the moon. Their story was born out of broken trust and years of frustration. It is the result of killings where victims felt the response of the government was poor or biased. For years, official responses simplified these agonies as mere communal clashes and called on all parties to give peace a chance. Those who complained of targeted violence were not necessarily ignoring the experiences of others, they were telling their lived experiences based on the patterns of violence they faced. They reacted to the structural challenges they faced in accessing justice. If the government felt their story was not a true reflection of reality, what it needs to win their trust is not an investment in media through a Washington lobby group. Trust must be earned through protection and accountability on the ground. The limits of discursive governance One of the defining challenges of the present leadership is the overt prioritisation of discursive governance. This is the reliance on information, media narratives, and propaganda to address citizens' genuine concerns. This lobbying deal reflects a deep administrative challenge where the state seeks to counter narratives and drown out dissent. More troublingly, it involves a form of cancel culture in which dissenting voices are sometimes labelled enemies of the state. This pattern has its history in the past of the current leadership. During their years as an opposition group, they relied heavily on information and discursive strategies to gain trust and build legitimacy. However, as a government in power, such a pattern creates deep mistrust. It undermines the state's legitimacy among those with genuine reasons for complaint and agitat",
    "fulltext_len": 5000
  },
  {
    "title": "Nigeria : Time , Tragedy , Nigeria - Looking Ahead Into 2026",
    "url": "https://allafrica.com/stories/202601020014.html",
    "source": "allafrica.com",
    "date": "20260102T063000Z",
    "category": "analytical",
    "fulltext": "Chronos - time, they say is the judge of history. Time also goes by quietly and mostly cannot be regained. On the first day of a new year (2026), we have a sacred duty, like the two-faced Greek God Janus (from where we get January), look back before we can look into the future. Whenever we fail to act righteously, justly and truthfully in time, we allow evil to mature in and through time. Nigeria, its leadership, and its people have wasted time. Instead of building, we have been tearing down. Instead of fighting corruption, we have nursed and enabled it. Instead of virtue, we have chosen vice for far too long. And time keeps going leaving our nation and its hubris to dwell in the darkness that it has chosen. All the tragic drama of 2025 is basically our chickens coming back home to roost. Beyond the violence, carnage and the incineration of entire communities, we forget that time records history by which tomorrow will remember our names and times. The tragedy of a nation is exposed when men/women who hold power sacrifice the truth for political and economic expediencies. More tragic is when the ruling class no longer are able to distinguish the difference between moral rectitude and deformed (and often time deranged) appetite for avarice and greed. A nation's termination is marked when the rule of law is jettisoned for cabalistic interests, when various factions exist in their own bragging rights and operate according to their own laws with unbridled impunity. The bellicosity, gargantuan appetites, and absurdities which have become the hall mark of the Nigerian elitist political class has found an insidious way to replicate itself in the majority of the populace creating a conflicting dilemma of a \"rat race,\" a situation of \"a survival of the fittest.\" If as Plato said, \"you do not take an interest in the affairs of your government, then you are doomed to live under the rule of fools.\" And yet time keeps running by... The Nunc-dimittis begins to sing itself as a dirge for a nation where the lives of the citizens are worth less than that of a cow. An entire nation looks on as maniacs, emboldened state and non-state actors decimate mosques, churches and sack entire villages. The real beasts are not only the notorious \"Fulani\" herdsmen, Boko Harram, kidnappers, armed robbers, and terrorists who have successfully, over the years created a parallel state within our nation; the real beasts are those who strut in the corridors of power, who sponsor, abet, and enable anarchists, acting with arrogance and impunity. Worse still is the impotence of the nation's governance to call these known puppeteers to justice. The puerility of our nation's erstwhile almost invincible military might seem to have become a toothless bulldog, scraggly mongrel about to sink into the dusk of past military glory. The Nigerian military can quell a coup within twenty fours hours in a neighbouring country but at home is unable to suppress anarchists and terrorists. Again, time will be the judge! No rational person pretends to sleep through a storm. s/he acknowledges the fact when the roof is on fire and acts proactively to save life and if possible, property; that is facing reality not some delusional optimism where you consciously avoid the elephant in the room and applaud inessentials germane to your welfare and longevity. We have at best a government lacking in clear ability to logically process issues. Rather, they act on impulse, a sudden adrenaline rush to the head. One after another, they make decisions that make one wonder which part of their physiology they reason from? Otherwise, how do you explain the capture of insurgents who have terrorized, maimed and murdered innocent citizens, then the government claims they are rehabilitated and immediately enroll them in the nation's army? How does one logically process the fact that the government of Nigeria have a comprehensive list of those sponsoring banditry and terrorism, and they are walking free, worse still they are participants in governance. It is only in Nigeria that we have different government and non-governmental actors negotiating between our nation's invaders, plunderers, rapist and mass murderers, and they speak boldly and act impunitively. These vile characters, at this time, hold an entire nation in a vice grip of death. Time will be the judge! Keep up with the latest headlines on WhatsApp | LinkedIn Even at this miserable time, those who are in power are in denial. It is only by the intervention of the US that the sleeping giant is beginning to stare- but not yet awake. Why should other nations have to tell us what we know already; that our nation is a joke, which for years we have avoided confronting? Clowns, career criminals, and near neanderthals are the ruling class and you expect to build a nation? They change the story to fit their own narrative without an iota of respect for truth and decency. To our national disgrace, there are people who are voicing publicly t",
    "fulltext_len": 5000
  },
  {
    "title": "Nigeria has a high poverty rate – what this has to do with ethnic conflicts",
    "url": "https://theconversation.com/nigeria-has-a-high-poverty-rate-what-this-has-to-do-with-ethnic-conflicts-270649",
    "source": "theconversation.com",
    "date": "2026-01-06",
    "category": "analytical",
    "fulltext": "Nigeria has endured decades of violent insurgencies and ranks 6th on the 2025 Global Terrorism Index. Numerous people have been killed and millions displaced. The number of casualties from terrorist attacks in 2025 can be seen in both the Armed Conflict Location & Event Data and the Council on Foreign Relations’ Nigeria Security Tracker . Most of the casualties are in places with high poverty levels, as the Nigerian Poverty Map shows. Tolu Olarewaju , who has researched ethnic poverty , unpacks why regions of violence and poverty overlap in Nigeria. What is the state of poverty in Nigeria? Poverty in Nigeria comes in various forms: a lack of income and productive resources to sustain livelihoods; hunger and malnutrition; illness and death; and limited access to education and other basic services. It includes inadequate housing and unsafe environments. It is also seen in a lack of participation in decision-making and civil, social and cultural life. Nigeria currently has a population of 237 million people and over 133 million Nigerians are living in this kind of poverty. It is higher in rural areas, where 72% of people are poor, compared to 42% of people in urban areas. The current poverty in Nigeria is the result of two key factors: history – particularly the slave trade and British colonial rule, which put the economic gain of the British Empire ahead of the development of the local population corruption and poor governance practices. My work shows that when initiatives are introduced to reduce poverty in Nigeria, they are often hijacked by corrupt individuals. There have been numerous government efforts to combat poverty in Nigeria. The current administration launched the “ Renewed Hope Conditional Cash Transfer ” programme in October 2023 to cushion the effects of its fuel subsidy removal, which had raised the cost of living and caused inflation. The programme hasn’t made much impact on the level of poverty in the country. The failures of successive Nigerian governments to reduce poverty stem from multiple factors. They include corruption, poor targeting of programmes, limited funding, weak legislative oversight, political interference, and the absence of a flexible, people-centred approach. Meanwhile, poverty is the common thread across the places experiencing terrorism in Nigeria. Poor people are more likely to be recruited into terrorist groups, and their targets are likely to be poor people like themselves. What is ethnic poverty? Ethnic poverty occurs when there is systemic poverty for an ethnic group. An ethnic group is a social group that shares a common and distinctive history, culture, religion, language, or the like. My work on ethnic poverty also shows that it can lead to conflicts that are easily labelled as ethnic, religious or tribal. Ethnic poverty disparities, uneven development and radical ideologies will make any country susceptible to violent insurgencies. This has occurred, for example, in Rwanda , Sri Lanka , Bosnia and Herzegovina , and Ethiopia . Ethnic poverty can increase hatred and violence, but economic growth could create a “win-win solution” if wealth can be shared equitably. Nigeria is a multinational state where more than 250 ethnic groups live, speaking over 500 distinct languages. The three largest ethnic groups are the Hausa in the north, the Yoruba in the west, and the Igbo in the east. The country is prone to violent insurgencies where armed groups who suffer from ethnic poverty try to overthrow the government. How does ethnic poverty play out in Nigeria? Poverty in Nigeria is intertwined with ethnicity. Inequalities in wealth and education persist between ethnic groups and regions. For example, 65% of the poor and less educated live in the north, where the Hausa and Fulani ethnic groups are predominant. Poverty levels across states also vary. The incidence of multidimensional poverty ranges from a low of 27% in Ondo (in the south) to a high of 91% in Sokoto (in the north). What are the solutions to ethnic poverty? There is no single solution, but several that will mature over time. The Nigerian government should: Hold transparent discussions and elections to decide if a regional system of government that focuses on local problems will be better than the current centrally planned government. Devise a strategy that combats corruption and focuses on ethnic groups with higher poverty rates. Expand education and vocational training to promote peace and tolerance, and employable skills linked to local markets. Deliver entrepreneurship training and financial literacy programmes to foster self-reliance and community-based economic growth. Offer incentives for responsible industrial development and local enterprise investment in areas of high ethnic poverty. Implement policies that promote balanced urban–rural economic growth and integrate ethnic populations economically into the national story. Invest in transport, digital and communication infrastructure in remote areas to i",
    "fulltext_len": 5000
  },
  {
    "title": "Nigeria : Ignore Old , Fake Claim That Nigeria Abia State Government Stopped Financial Crimes Commission Convoy and Demanded Release of Arrested Youths",
    "url": "https://allafrica.com/stories/202601190056.html",
    "source": "allafrica.com",
    "date": "20260119T104500Z",
    "category": "analytical",
    "fulltext": "Ignore old, fake claim that Nigeria's Abia state government stopped financial crimes commission convoy and demanded release of arrested youths IN SHORT: Facebook posts have claimed, once again, that Abia state governor Alex Otti stopped an Economic and Financial Crims Commission convoy in Aba and ordered the agency out of the city, attributing inflammatory remarks to him. But this is false and has circulated since May 2025. Several Facebook users have claimed that Alex Otti , Abia state's governor, stopped a convoy of the Economic and Financial Crimes Commission (EFCC) to demand the release of young boys arrested in Aba and instructed the EFCC to leave Aba. The EFCC is the agency responsible for fighting financial crimes in Nigeria. Follow us on WhatsApp | LinkedIn for the latest headlines One post, dated 7 January 2026, reads : \"The Abia State Government has blocked the convoy of the EFCC in Aba after they arrested more than 59 youths and attempted to move them to Abuja. Governor Otti ordered his security team to stop the convoy and demanded the immediate release of all 59 boys, instructing them to leave Aba at once.\" Africa Check fact-checked the same claim, word-for-word, in May 2025 and found it to be untrue and that the state government had denied it. The claim resurfaced again in January 2026, with the same statement attributed to Otti: \"Aba boys are not thieves or killer herdsmen. No such arrests of my people will happen under my watch. Head back to Sokoto and arrest the Fulani herdsmen, not innocent Aba youths.\" Aba is the major commercial and industrial hub of Abia state in southeastern Nigeria. Sokoto state is in the northwestern region. In Nigeria, tensions between Fulani herders and farming communities have intensified due to competition over land and resources. While some criminal activities, such as armed attacks, kidnappings, and banditry, have been attributed to individuals identified as Fulani, there is no evidence that the group as a whole is involved in crime The same claim can be found here , here , here , here and here . But did Otti block an EFCC convoy for arresting Aba boys? We checked 'Fake news' Ferdinand Ekeoma, the senior special adviser to Abia state governor on media and publicity, told Business Day the story was \"false and baseless\" and urged the public to disregard the claim. \"There was no such statement from the governor and no action or engagement of that kind with the EFCC. So, it is completely false and should be ignored. Nothing like that happened,\" he said. Sign up for free AllAfrica Newsletters Get the latest in African news delivered straight to your inbox Success! Almost finished... We need to confirm your email address. To complete the process, please follow the instructions in the email we just sent you. Error! There was a problem processing your submission. Please try again later. The claim, which first surfaced in May 2025, is a recycled one. It remains untrue.",
    "fulltext_len": 2958
  },
  {
    "title": "Trump supporters hail US strikes in Nigeria as ‘amazing Christmas present’",
    "url": "https://www.theguardian.com/us-news/2025/dec/26/trump-supporters-nigeria-airstrikes",
    "source": "theguardian.com",
    "date": "2025-12-26",
    "category": "analytical",
    "fulltext": "The US’s Christmas Day strikes against Islamic State targets in Nigeria have been met with praise by Donald Trump supporters who for months had been agitating for the president to respond forcefully to the killings of Christians in the country. “I can’t think of a better way to celebrate Christmas than by avenging the death of Christians through the justified mass killing of Islamic terrorists,” the far-right political activist Laura Loomer posted on X. “You’ve got to love it! Death to all Islamic terrorists! Thank you.” Loomer said she had been informed by the US defense department – which the Trump administration calls the war department – that the American cruise missile strikes carried out with the Nigerian government’s cooperation had been “a direct response to [IS] jihadi terrorists killing Christians in Nigeria”. The US House member Randy Fine, a Florida Republican who in November supported a congressional resolution calling for Nigeria to be designated a “country of particular concern” due to its religious violence, described Thursday’s strikes as an “amazing Christmas present!” “With Muslim terrorists attacking Christians in Nigeria, Syria, and even Europe – simply for refusing to submit to Islam – the president is showing that we will no longer tolerate these barbarians,” Fine said on X , after suggesting earlier in December that “mainstream Muslims” should be “destroyed”. The uniformity of the Republicans’ response comes in contrast to a campaign involving economic pressure as well as airstrikes on alleged drug boats that the Trump administration is waging on Venezuela to oust its president, Nicolás Maduro. Some Republicans have warned that the history of US “regime change” efforts are not promising and have warned against direct military strikes on Venezuela. Attacks on Christians by Islamic extremist groups in Nigeria such as Boko Haram had been drawing increased attention from US Christian groups that are generally aligned with Trump. “Do not test President Trump‘s resolved [sic] in this matter,” said a post from the Republican US House member Riley Moore of West Virginia, who introduced the Nigeria-related congressional resolution in November. “Tonight’s strike in coordination with the Nigerian government is just the first step to ending the slaughter of Christians and the security crisis affecting all Nigerians.” In further comments on Friday, other Republican lawmakers praised Trump for carrying out the strikes. North Carolina senator Ted Budd, a Republican, said that IS “is responsible for the deaths of thousands of Christians & religious minorities in Nigeria”. Budd wrote that Trump’s “decisive strikes will save lives & protect religious freedom. May God bless our brave men & women in uniform.” Congressman Bill Huizenga, a Michigan Republican who recently led a delegation to Nigeria, said that attitudes within the Nigerian government were “beginning to turn in favor of protecting Christians – in addition to taking actions against those terrorizing Christians and moderate Muslims”. Senator Tom Cotton, an Arkansas Republican, said on X that he commended the Trump administration as well as American troops for “these strikes against bloodthirsty [IS] savages who are not only persecuting Christians, but also have killed many Americans”. Pressure on the administration to act in Nigeria had been building since July, when the US Commission on International Religious Freedom issued an advisory that said the Nigerian government was “often unable to prevent or slow to react to violent attacks by Fulani herders, bandit gangs, and insurgent entities such as JAS/Boko Haram and the Islamic State West Africa Province (ISWAP)”. In October, Ted Cruz – a Republican senator from Texas – said the US was able to identify the perpetrators of anti-Christian violence in Nigeria “and I intend to hold them accountable”. Cruz said that since 2009, “over 50,000 Christians in Nigeria have been massacred, and over 18,000 churches and 2,000 Christian schools have been destroyed”. At the recent AmericaFest, a four-day gathering of US conservative organized by Turning Point USA, the Trinidadian rap star Nicki Minaj spoke with Charlie Kirk’s widow, Erika Kirk, on the oppression of Christians in Nigeria. She said she loved Nigeria in part because her pastor is Nigerian. “Hearing that people are being kidnapped – while they’re in church, people are being kidnapped, people are being killed, brutalized, all because of their religion – that should spark outrage in America, and that’s what it’s doing,” Minaj said. Trump told Politico on Friday that the Christmas strike was originally to take place on Wednesday, but the president had the operation delayed until Thursday for symbolic reasons. “I said, ‘Nope, let’s give a Christmas present,’” Trump remarked to the outlet. “They didn’t think that was coming, but we hit them hard. Every camp got decimated.” Thursday’s strikes in Nigeria come less than a week after the US hit more tha",
    "fulltext_len": 5000
  },
  {
    "title": "Nigeria : Fresh X Spat Drags El - Rufai Sons Back Into Vulgar Online Exchanges",
    "url": "https://allafrica.com/stories/202512140022.html",
    "source": "allafrica.com",
    "date": "20251214T180000Z",
    "category": "analytical",
    "fulltext": "The El-Rufai sons, Bashir and Bello, have repeatedly sparked national debate over vulgar, threatening, and politically charged posts on X. A fresh social media altercation involving Bashir and Bello El-Rufai, sons of former Kaduna State governor Nasir El-Rufai, has once again thrust the family into a stormy national conversation about online conduct, political privilege and toxic tone of public discourse on X (formerly Twitter). The latest episode, which unfolded over several hours, began as a relatively sober debate on governance and alleged selective accountability under the President Bola Tinubu administration. It, however, quickly degenerated into personal insults, references to family members and vulgar language. Keep up with the latest headlines on WhatsApp | LinkedIn How the exchange began Trouble started when an X user, @SodiqTade, criticised the arrest of opposition figures close to another election cycle, arguing that such actions amounted to political suppression rather than a genuine anti-corruption drive. He tweeted: \"If you are arresting opposition stakeholders a year to another election, you are not fighting corruption, you are simply fighting and suppressing the opposition. You didn't arrest them in your first and second year btw. We are not novice here. We are in a democracy.\" The post triggered a chain of responses questioning the consistency of the government's anti-corruption efforts. Another user, @dawisu, escalated the argument, alleging selective justice and questioning why some politicians with pending corruption cases appeared untouched by the Economic and Financial Crimes Commission (EFCC), yet remained in the good books of those in power. He tweeted, \"People with active corruption cases who are standing on the president's mandate are not only untouched by EFCC, but are openly dining with him. Somehow their 'support' seems to be stronger than the law. This govt really knows how to pick and choose when accountability matters!\" The conversation took a sharper turn when @yojora interjected with a pointed question, referring to a viral 2018 clip involving former governor of Kano State, Abdullahi Ganduje, allegedly receiving and stuffing United States dollars into his babariga, \"What category is someone who appeared in a video to be stuffing dollar in his Babariga?\" At that point, Bashir El-Rufai stepped into the thread. In a reply that shifted the debate from policy to personalities, his thinly veiled sarcasm suggested that such a person belonged in the same category as those appointed party chairpersons by political benefactors. He wrote: \"Good morning, Sir. Someone said I should tell you that that person would be in the same category with the individual that deemed it fit to appoint him as his political party's Chairman.\" The response drew a sharp rebuttal from @yojora, who broadened the allegation, \"Oh absolutely, they are the same. Including the ones that shared land to their... \" Bashir demanded specifics and proof, insisting that lawful inheritance or allocation of land to children was not illegal. He then added a controversial comparison, \"Sharing land to one's children through due process is not illegal, far from selling cocaine and being an accountant of a cartel thereof, based in the windy city of Chicago.\" The conversation intensified as @yojora fired back with a direct accusation against Bashir's father, \"You are a fool for coming at me with this clownery!! Your father, Nasir El-Rufai revoked land as FCT minister and allocated them to his family members.\" Bashir's response marked the moment the conversation crossed fully into vulgar territory, \"It is your mother that is a fool. Since you refuse to act your age upon all the grey hair.\" @yojora thereafter attached a 2012 tweet in which an X user had publicly asked Nasir El-Rufai whether he revoked plots and reallocated them to family members. El-Rufai had replied at the time:\"..8 plots out of 27,000 i approved, yes!\" Bello El-Rufai joins the fray It was not long before Bello El-Rufai, the lawmaker representing Kaduna North federal constituency, joined the exchange. He denied owning any land, dismissed the allegation as baseless and warned that he would \"drag\" the user publicly if accused again, invoking another reference to the user's mother in the process. \"You're actually decent in some of your views. But I am the next El Rufai after Mallam. Unless your Momsy is my side chick, there's still no land in my name. Did I put it in her name? For your sake, clarify the family members. There's no land in my name. I am in APC, but I'll make time to drag you like a dirty generator if you accuse me of land I don't have. And I assure you, no one will save you. No SA, SSA or anyone. Hence the Momsy reference, not personal. You brought Popsy here.I partly blame Bash.\" The post drew immediate backlash, not only for its confrontational tone but also for references to \"Momsy\" and threats of personal retaliation, which many users described a",
    "fulltext_len": 5000
  },
  {
    "title": "U . S . Congressman Says Fulani Militants Carrying Out  Genocidal Campaign  Against Christians After Nigeria Visit , To Report To Trump",
    "url": "https://saharareporters.com/2025/12/12/us-congressman-says-fulani-militants-carrying-out-genocidal-campaign-against-christians",
    "source": "saharareporters.com",
    "date": "20251212T090000Z",
    "category": "nigerian",
    "fulltext": "U.S. Republican Congressman Riley Moore has alleged that a wave of violent attacks on Christian communities in Nigeria’s Middle Belt amounts to a “genocidal campaign,” vowing to brief President Donald Trump after leading a high-risk Congressional delegation to Benue State. Speaking on Fox News’ The Faulkner Focus, Moore said he and four other members of the U.S. House Appropriations Committee toured several Internally Displaced Persons (IDP) camps in Benue, travelling in armored vehicles due to worsening insecurity. According to him, the delegation met with Catholic Bishops Wilfred Anagbe and Stephen Dugu, the Tor Tiv, and dozens of displaced victims, “all of whom are Christians.” Moore claimed that Fulani militants he described as “Islamic radicals” were routinely attacking IDP camps and wiping out Christian communities. He recounted meeting a woman who was forced to watch “five of her children murdered in front of her” by attackers. “She was pregnant at the time and escaped. She had that baby at an IDP camp. Her soul had literally left her body,” he said. In another case, Moore said that a woman’s unborn child was “cut out of her” after her husband and two daughters were killed during a separate attack. The Congressman dismissed long-standing explanations that the violence stems from climate pressures, land competition, or economic rivalry, narratives often cited by researchers and Nigerian officials. “If this is climate change, why burn a church? Why attack an IDP camp shouting ‘Allahu Akbar’?” he asked. “They are trying to erase Christians from their ancestral homeland in Benue State and across Nigeria,” he insisted. Moore disclosed that President Trump had directed him and House Appropriations Committee Chair Tom Cole to prepare a detailed report recommending how the U.S. should engage Nigerian authorities on the crisis. He said the Benue trip was a “fact-finding mission” to gather “ground truth,” with the report expected to be submitted before the end of the month. He further insisted that the IDP camps were not the safe havens Nigerian authorities portray them to be. “These camps aren’t protected. People are terrified,” he said. Moore’s claims underscore a longstanding controversy surrounding violence in Nigeria’s Middle Belt, where thousands have been killed over the years in clashes between farming communities and armed herders. Rights groups accuse Nigerian authorities of downplaying atrocities and failing to prosecute offenders, while critics argue that foreign officials often oversimplify the conflict into a purely religious war. Describing some of the harrowing moments from the trip, Moore explained that “many Christians are being murdered for their faith in our Lord and Savior Jesus Christ,” adding that the delegation met with church leaders, Christian associations, and local communities.",
    "fulltext_len": 2853
  },
  {
    "title": "How emotional blackmail derails Nigeria security talks",
    "url": "https://punchng.com/insecurity-and-that-emotional-blackmail/",
    "source": "punchng.com",
    "date": "20251205T021500Z",
    "category": "nigerian",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "Sunday Igboho Return : Monarchs Secure Presidential Pardon",
    "url": "https://punchng.com/igboho-removed-from-wanted-list-after-monarchs-intervention-spokesman/",
    "source": "punchng.com",
    "date": "20260126T014500Z",
    "category": "nigerian",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "US officials to brief Trump on Nigeria killings fact - finding",
    "url": "https://punchng.com/nigeria-killings-us-officials-prepare-high-level-briefing-for-trump/",
    "source": "punchng.com",
    "date": "20251212T011500Z",
    "category": "nigerian",
    "fulltext": "",
    "fulltext_len": 0
  },
  {
    "title": "  Nigerian Military Cant Win War Against Bandits , Says Sheikh Gumi",
    "url": "https://saharareporters.com/2025/12/09/nigerian-military-cant-win-war-against-bandits-says-sheikh-gumi",
    "source": "saharareporters.com",
    "date": "20251209T203000Z",
    "category": "nigerian",
    "fulltext": "Islamic cleric Sheikh Ahmad Gumi has declared that the Nigerian military is incapable of defeating the country’s bandit groups through force, insisting that negotiations remain the only viable path to ending the escalating insecurity in the northwest and beyond. Speaking in an exclusive interview with the BBC , Gumi argued that modern armies worldwide struggle against guerrilla fighters and that Nigeria is no exception. “But even the military says that in dealing with this civil unrest and criminality, only 25% is kinetic action; the rest depends on the government, politics, and local communities. The military cannot do everything,” he said. “Where have you ever seen the military defeat guerrilla fighters? Nowhere.” His remarks come as President Bola Tinubu’s administration rolls out sweeping security reforms, including changes in military leadership and a nationwide security emergency aimed at crushing violent groups responsible for mass kidnappings, extortion, and rural attacks. Gumi also addressed years-long accusations of maintaining relationships with bandit leaders. He insisted he has had no contact with them since 2021, the year the federal government formally designated the groups as terrorists. “I never went there alone,” he said. “It was in 2021 when I was trying to see how we could bring them together. But unfortunately, the government at the time, the federal government, was not interested. They declared them terrorists, and since that time we have completely disengaged from all contact with them.” Despite criticism that his advocacy emboldens armed groups and undermines state authority, the cleric maintains that negotiating with non-state actors is standard global practice. “When they say we don’t negotiate with terrorists, I don’t know where they got that from,” Gumi said. “It is not in the Bible, it is not in the Quran. America had an office negotiating with the Taliban in Qatar. Everyone negotiates with outlaws if it will stop bloodshed.” Gumi described the armed groups tormenting the northwest, and increasingly other regions, as largely “Fulani herdsmen” engaged in what he termed an “existential war” linked to threats to their traditional livelihoods of cattle rearing. “They want to exist. That is their life. They know where to graze and how to care for their cattle,” he said, adding that the crisis has evolved from local farmer–herder tensions into widespread criminality. The cleric has long faced public backlash for his engagements with bandits and for statements such as his earlier claim that kidnapping schoolchildren is a “lesser evil” than killing soldiers.",
    "fulltext_len": 2625
  },
  {
    "title": "Pastoral Challenges And The Misunderstood Conversation",
    "url": "https://dailytrust.com/pastoral-challenges-and-the-misunderstood-conversation/",
    "source": "dailytrust.com",
    "date": "20251208T063000Z",
    "category": "nigerian",
    "fulltext": "Nigeria’s livestock sector has once again found itself at the centre of public controversy — this time, due to a serious misquotation at the recently concluded maiden edition of the National Livestock Development Council in Yola, Adamawa State. The Minister of Livestock Development was widely reported by sections of the media as declaring that the federal government had banned or outlawed open grazing nationwide. Within hours, the misinformation spread like wildfire, igniting heated debates across social media and feeding into the already sensitive discourse around pastoralism. To his credit, the Minister promptly issued a press release denouncing the report as false, clarifying that the government has not taken such a blanket position, and reaffirming that any future livestock reforms would be rooted in consultation, phased implementation, and adherence to constitutional provisions. SPONSOR AD This media misinterpretation is not a trivial matter. It reflects a larger problem: a national conversation on pastoralism that is often driven by emotions, stereotypes, and half-truths rather than evidence, context, or genuine understanding. And nowhere is this misunderstanding more damaging than in discussions about Sahelian pastoralists — particularly the Fulani who form the backbone of Nigeria’s cattle economy. Pastoralism is not merely an occupation; it is an ancient system of survival, knowledge, mobility, and community. Sahelian pastoralists are nomadic and semi-nomadic herders who traverse the savannah belt of West and Central Africa, managing cattle, sheep, goats, and camels. In Nigeria, the largest group is the Fulani, known locally as Bororo’en or Mbororo whose transhumance routes predate the Nigerian state itself. Their contribution to the national economy is immense. They supply a major share of the beef consumed in the country, sustain vibrant dairy chains, and support rural economies that would collapse without livestock mobility. They maintain cultural traditions and networks that bind the Sahel together. Yet despite this importance, pastoralists are today confronted with a series of multi-dimensional crises that threaten their survival and Nigeria’s broader stability. As a consequence of climate change, desertification as a first wave of crisis is advancing southward at over 350,000 hectares every year. Pastures shrink, water points disappear, and the rainy season becomes increasingly erratic. Traditional knowledge which previously allowed herders to predict weather patterns is being disrupted. As grazing land declines, herders now travel longer distances, increasing the likelihood of conflict, exposing livestock to disease, and destabilizing family structures. Many pastoralists are climate refugees long before the term became fashionable. Nigeria once maintained a functional system of grazing reserves and livestock corridors that are now getting lost. Over time, urban expansion, mechanized farming, and infrastructural development have encroached upon these lands. Stock routes are blocked, converted, or erased entirely. Without access to rangelands or safe mobility, pastoralists are pushed into territories where tensions are inevitable. This structural loss is often overlooked in public debates that narrowly frame conflicts as purely ethnic or religious. Nigeria’s farmer-herder conflict, that was a symptom and not the disease, has now escalated into one of the deadliest internal security crises in the country. Competition for land and water, weapon proliferation, governance gaps, and ethno-religious sentiments have created cycles of violence in states such as Benue, Plateau, Taraba, and Kaduna. Farmers often feel invaded; herders often feel criminalised. Yet both are victims of the same structural weaknesses: lack of land use planning, degraded ecosystems, weak mediation systems, and absence of modern livestock management infrastructure. The collapse of security architecture across rural Nigeria has degenerated into banditry, and the erosion of trust especially in the North West, has further worsened the situation. Armed bandits, rustlers, and kidnappers terrorise both farmers and herders. Pastoral communities are displaced, impoverished, and sometimes coerced into criminal networks. This insecurity damages national cohesion and weakens public trust in government institutions. Despite being central to Nigeria’s meat and dairy supply, pastoralists remain politically marginalised. Their voices are rarely included in policy making processes. Initiatives like the National Livestock Transformation Plan (NLTP) have stalled due to inadequate grassroots involvement. Local bylaws that criminalise mobility further alienate mobile herders. Pastoralist communities suffer some of the lowest human development gap social indicators in the country: Nomadic schools are underfunded; due to mobility, they lack access to healthcare and veterinary services. Women and youth face deep socio-economic exclusion. Though ECOWA",
    "fulltext_len": 5000
  },
  {
    "title": "The security threats testing Nigeria Fourth Republic",
    "url": "https://dailytrust.com/the-security-threats-testing-nigerias-fourth-republic/",
    "source": "dailytrust.com",
    "date": "20260126T081500Z",
    "category": "nigerian",
    "fulltext": "In the last 26 years since its return to democratic rule, Nigeria’s Fourth Republic has grappled with a security landscape that is shaped by violent extremism rooted in deep-seated ideological movements, recurring communal clashes, ethnic strife, and the protracted farmer–herder conflicts. Other forms of insecurity, driven by marginalisation and ethnic agitations, have steadily escalated. Together, these dynamics have compounded national instability, leaving the country increasingly vulnerable to foreign interference. Experts point to a web of interlocking drivers behind these crises. Weak institutions, entrenched ethnic and religious tensions, pervasive corruption, widespread displacements, poverty and unemployment, as well as systemic marginalisation, all form the backbone of Nigeria’s security challenges. Undeniably, the Fourth Republic has experienced repeated waves of militarisation, leaving the armed forces overstretched. From communal and ethno-religious riots in the north central, to militancy and cultism in the south-south, secessionist agitation in the south east, the prevalence of ritual and mob killings in the southwest, as well as the twin scourge of insurgency and banditry in the north east and north west respectively, successive governments have struggled to tackle these diverse yet interconnected threats. Analysts argue government’s failure to confront these threats forms the backbone of the narrow framing of Nigeria’s complex security challenge by the US government, as merely systematic attacks on Christian communities. Yet, in the last two decades, insurgency driven by Boko Haram and the Islamic State West Africa Province (ISWAP) in the north-east remains the most persistent and formidable violent threat that has tested the country’s military capacity and might. Since the escalation of Boko Haram in 2011, Nigeria has consistently remained among the ten most insecure nations on the Global Terrorism Index (GTI). By 2025, the country had climbed to 6th position, up from 8th in both 2023 and 2024, indicating worsening conditions. SPONSOR AD As part of its National Security Strategy, the Federal Government, beginning around 2015, shifted its focus militarily-ledtomilitary-led counterinsurgency and regional collaboration with neighbouring countries. The initiative, though it achieved territorial gains but opened up new violent frontiers of banditry in the north-west and secessionist agitation by the Indigenous People of Biafra (IPOB) in the south-east, widening the country’s security crisis and further stretching the capacity of security agents. Therefore, while the Fourth Republic marks Nigeria’s most enduring democratic run, the republic has equally endured its harshest security crises. security operatives inspecting a car damaged at the scene of the attack in marhaba village, matazu lga of the katsina state From local grievances to global threats The 2025 GTI report captured a September 2024 attack in Mafa village, Tarmuwa local government area of Yobe state as one of the 20 most fatal terrorist attacks of 2024. Suspected members of Boko Haram, moving on motorcycles, opened fire on a market and killed over 100 people while setting fire to shops and residences. From preaching against western education, the activities of Boko Haram and its affiliates have since gone beyond violent campaigns to the use of suicide bombers, improvised explosive devices and drone capabilities. Thousands of innocent lives, including Nigeria’s security forces, have been consumed by the insurgents’ carnage and millions have been displaced, altering the socio-economic fabrics of the north east region. But long before Boko Haram, Nigeria witnessed its first violent extremist group in the 1970’s, when Muhammadu Marwa, an Islamic preacher from Cameroon settled in Kano State and founded the Maitatsine movement. Similar in ideology to Boko Haram due to its stringent opposition to the Western way of life, the group had galvanised and incited youths against urban elites. Like Boko Haram, it culminated in riots that began in Kano in 1980 and spread to other parts of northern Nigeria, claiming thousands of lives, including Marwa. But analysts say over 45 years since the Maitatsine riot, the Nigerian government and specifically the leadership of northern Nigeria has failed to address the underlying factors that exacerbated these security challenges and catapulted Boko Haram into one of the world’s most vicious terrorists’ organizations. “The Maitatsine upheaval and this Boko Haram challenge are all rooted in the same challenges: state neglect, urban dislocation, and the alienation of poor youths, as well as women. They all fuel violent movements,” said Dr Kabiru Adamu, Managing Director of Beacon Consulting, a renowned firm providing enterprise risks and security management solutions in Nigeria and the Sahel. He described these existing drivers as a “combustible mix of both socioeconomic, political, and environmental factors,” s",
    "fulltext_len": 5000
  },
  {
    "title": "Of Orchestrated Insecurity And Intentional Governance – THISDAYLIVE",
    "url": "https://www.thisdaylive.com/2025/11/30/of-orchestrated-insecurity-and-intentional-governance/",
    "source": "thisdaylive.com",
    "date": "20251130T174500Z",
    "category": "nigerian",
    "fulltext": "By Mobolaji Sanusi “Good governance is the art of putting wise thought into prudent action in a way that advances the well-being of those governed.” —Diane Kale-Sukra The eerie air of insecurity tormenting our national spirits in recent days has made the country an object of gibelike remarks in global politics. The unsavoury development seems to have enervated a corrosive knob in our country’s topmost security hierarchy that has hitherto been epileptic. Encouragingly, one can only assume that the recent echoes of inspiring security vibes emanating from the nation’s federal seat of power in Abuja will, inexorably be sustained. For everything good that is desired, whether as individuals or as a nation, its attainment must be accorded intentional primacy. This probably informs why Richie Norton, a global thinker, executive coach to several world renowned CEOs and an award-winning author and serial entrepreneur once admonished on the perils of jettisoning intentional living by individuals, leaders, and nations, when he declared: “Intentional living is the art of making our own choices before others’ choices make us.” — I add; for good or for bad like the evil choice that organized terrorists are ravaging the country with. Recent insecurity challenges in the country are bringing out the truism in Norton’s statement and President Bola Ahmed Tinubu’s new approach of imbibing the hands-on/intentional technique is in this regard reassuring the public of presidential concerns and further helping in putting the rampaging terrorists on the run. Pointers to this fact are legion: First is the president’s responsive cancellation of his earlier planned trip to South Africa to attend the G-20 summit, opting instead to sit with his security and service chiefs to take charge, direct, and give ultimatum where necessary in his bid to achieve the goal of restoring security to the country. Secondly, the president declared a state of national security emergency as I proposed in my last week’s piece. Thirdly, he ordered the withdrawal of policemen attached to supposed ‘VIPs’ in the country with immediate effect and for the first time transited his often touted state police idea from the realm of rhetoric to boldly calling on the National Assembly to immediately commence a constitutional review process in that regard. It is crassly indefensible that 11,566 newly withdrawn policemen, consequent on the presidential order, were hitherto wasting away in our system’s bid to satisfy the egocentric pride of supposed ‘VIPs’ when a large chunk of the country is inadequately policed: Fourthly, he ordered that the military and police should employ more hands: Fifthly, the president put the entire security architecture in the country on red alert, especially in troubled terrorists’ areas. Commendable deeds and actionable pronouncements which should have come earlier but the truism; better late than never applies. A glimpse of what the consequences of being a hands-on or better put, an intentional President, unfurled immediately. Last Sunday, Governor AbdulRahman AbdulRazaq of Kwara state gleefully informed an elated Nigerian public that the thirty-eight persons recently abducted during an attack on Christ Apostolic Church in Eruku, Ekiti Local Government Area of his state had been released. He particularly applauded the hands-on/intentional efforts of Mr. President in making the mission a reality. The DSS, in particular, under Mr Tosin Ajayi, deserves commendation in this regard. Also, last weekend, the Christian Association of Nigeria (CAN) announced that fifty-one students from those abducted from a Catholic school in Niger state had ‘escaped’ from their captors’ captivity. Despite the recurred kidnappings of some inhabitants of Isapa on Monday after the release on Sunday of the abducted 38 CAC church members in neighbouring Eruku, and another similar incident same Monday in Kano state, it is obviously clear to the leadership of the Office of National Security Adviser (ONSA), the Department of State Services (DSS), the Nigerian Army, Nigeria Intelligence Agency, the Nigeria Police and even the terrorists that it is not business as usual with the newly adopted intentional approach of the president. It is important for the president to take more than a special interest in how to whip the nation back to the peaceful line through his results yielding new approach. Doing this, in spite of the orchestrated machinations of his political traducers that are criminally fueling the insurgency gambit, will solidify his personal, political, and administration’s survival. This is because a president can only preside over a peacefully functioning country devoid of international interference. The purported ‘escape’ and ‘release’ of the Niger and Kwara states abductees merely hint at how far we would have gone if the new intentional approach had come earlier. The terrorists’ choices of kidnappings, killings, bombings, raping, and abductions that were being in",
    "fulltext_len": 5000
  }
]